{"0": {"date_posted": "2/9/2015", "title": "KLCI down 1.01%, slips below 1,600 level", "article": " KUALA LUMPUR (Sept 2): The FBM KLCI fell 1.01% and slipped below the 1,600-point level at mid-morning today in line with the retreat at most global markets. At 10am, the FBM KLCI lost 16.20 points to 1,593.01. The top losers included Malayan Banking Bhd (Maybank), United Plantations Bhd, UMW Holdings Bhd, Freaser & Neave Holdings Bhd, Suiah Corporation Bhd, Genting Bhd, AMM Holdings Bhd, Axiata Group Bhd, IOI Corporation Bhd, Panasonic Malaysia Manufacturing Bhd and British American Tobacco (M) Bhd. The actives included APFT Bhd, AirAsia Bhd, The Media Shoppe Bhd, KNM Group Bhd, Sumatec Resources Bhd, Tiger Synergy Bhd and Maybank. The top gainers included Far East Corporation Bhd, V.S. Industry Bhd, Petronas Gas Bhd, APM Automotive Bhd, Kossan Rubber Industries Bhd and Guinness Anchor Bhd. Asian shares got off on the back foot on Wednesday after weak manufacturing activity reports from both the US and China sent Wall Street reeling, while the dollar steadied after steep losses, according to Reuters. US S&P e-mini equity futures were up 0.7, suggesting that some calm could return to markets later in the global day, it said. Hong Leong IB Research reiterated its view that the FBM KLCI\\u2019s relief rally from a 3\\u00bd year low of 1,504 on August 24 was ripe for profit taking consolidation, with stiff resistances near 1,654\\u20131,678 levels amid lingering internal and external concerns of political woes, 1MDB scandal, renewed worries of Malaysia sovereign ratings, sliding currencies and commodity prices, ballooning external debt, ailing stock market, falling international reserves, China rapid slowdown and the timing of Fed\\u2019s rate hike."}, "1": {"date_posted": "25/6/2014", "title": "KLCI hits record high", "article": " KUALA LUMPUR: The FBM KLCI closed at a new high of 1,892.33 points yesterday on the back of continued buying interest from foreign funds and in line with regional gains. The benchmark index rose 8.37 points, or 0.44%, to close at its highest point of the day, beating the previous record of 1,887.07 achieved on May 19. Other Asian markets also closed higher, buoyed by encouraging manufacturing data from China, Japan and the United States. In the broader market, gainers outnumbered losers with 451 stocks ending higher and 396 stocks finishing lower. \\u201cThat gave a market breadth of 1.13, indicating the bulls were in control,\\u201d Alliance DBS Research observed in a report late yesterday. Given that the buying power was stronger than selling pressure, the KLCI is likely to trade even higher than the 1,892.33 level today, it added. Some 2.01 billion shares worth RM2.17 billion changed hands yesterday. Gains in select blue chips, namely Tenaga Nasional Bhd, Petronas Gas Bhd, YTL Corp Bhd, Axiata Group Bhd and Sime Darby Bhd, helped push the index up. The biggest mover was Tenaga, which closed 22 sen higher to RM12.06 on volume of 8.76 million shares. It added 2.4521 points to the KLCI. The most active counter was Sumatec Resources Corp Bhd after it announced that it had yielded more oil from its Kazakhstan field. The new record brought the index closer to local brokerage firms\\u2019 targets for the year-end. UOB Kay Hian Research and MIDF Research have among the lowest year-end target forecasts, at 1,900 points, which implies a mere 0.41% upside from here on. However, CIMB Research\\u2019s forecast, among the most bullish, at 2,030 points, implies a 7.28% upside. Meanwhile, the spot ringgit was also higher against the US dollar yesterday, as it closed at RM3.2135 per dollar compared with Monday\\u2019s RM3.2195. Reuters reported that other Southeast Asian stock indices also made gains after manufacturing surveys, leading indicators of output trends, showed factory activity in the US, China and Japan rose strongly in May. In Asia, apart from Thailand, all other key indices closed higher. Foreign funds have been net buyers on Bursa Malaysia for the past nine weeks, according to data compiled by MIDF Research. A total of US$1.21 billion (RM3.89 billion) of net foreign inflow was recorded up to last Friday. This article first appeared in The Edge Financial Daily, on June 25, 2014."}, "2": {"date_posted": "6/6/2014", "title": "Market close: KLCI falls 0.34% on plantation shares, ahead of US job report", "article": " KUALA LUMPUR (June 6): The FBM KLCI fell 0.34% on the decline of plantation stocks, and as investors await the US jobs report. At 5pm, the KLCI fell 6.30 points to 1,862.70. The exchange had fallen on plantation stocks like PPB Group Bhd and Sime Darby Bhd.  Tenaga Nasional Bhd, Axiata Group Bhd and Public Bank had also contributed to the KLCI's decline. The KLCI had traded between a high of 1870.61 and a low of 1860.2. Bursa Malaysia saw a total of 1.27 billion shares worth RM1.4 billion traded. Decliners outpaced gainers, 397 to 323, while 354 counters remained unchanged. The top gainer was TAHPS Group Bhd, which was slapped with a UMA query after a 32% rise from its closing price last Thursday. The top decliner was Petronas Dagangan Bhd while the most active stock was Etitech Corporation Bhd. Choo Swee Kee, chief investment officer of TA Investment Management Bhd said: \\u201cThere are not many catalysts for the market at the moment and folks are probably getting ready for the World Cup and school holidays.\\u201d He said\\u00a0 the market was expected to hold at its current levels. The KLCI's support is seen at around 1850. Across Asia, Hong Kong's Hang Seng fell 0.69% to 22,951, while the South Korean Kospi saw a 0.65% decline Reuters reported that Asian markets turned mixed today as investors offered only polite applause for the European Central Bank's latest stimulus package. Trading was hesitant as attention quickly shifted to the U.S. payrolls report due later on Friday, the outcome of which is considered even more uncertain than usual. Malaysian palm oil futures edged lower on Friday, setting the tropical oil on track for a third straight weekly fall as a stronger ringgit and weak soy markets continued to drag, along with the prospect of bigger stockpiles."}, "3": {"date_posted": "6/6/2014", "title": "Maybank IB: No change to year-end KLCI target of 1,940", "article": " KUALA LUMPUR: Maybank IB Research said it is maintaining its year-end target for the FBM KLCI at 1,940 points, implying a 12-month forward earnings ratio of 16 times, it said in a strategy note.  The research house said it had shaved off its estimates on the index\\u2019s core earnings by 0.7% for 2014 and 1.1% for 2015, following the results reporting season in the first quarter (1Q) of 2014, after tweaking forecasts for a few bank, utility, and oil and gas stocks.  \\u201cWe now expect the KLCI\\u2019s core earnings to grow a slower 7% to 8% in 2014/2015 vs 8.1% to 8% previously. With the exception of the auto and gaming (numbers forecast operator) sectors in which we anticipate earnings to contract, and the aviation sector where we expect the combined earnings to remain in the red, we expect all other sectors to record earnings growth this year,\\u201d it said.  Maybank IB said there was no change to its sector weightage.  \\u201cWe remain \\u201coverweight\\u201d on construction, oil and gas, power and gloves. We also remain selective on stocks, with no major changes in our stock picks,\\u201d it said.  Overall for 1Q ended March 31, the research house said the season had been relatively neutral, with 65% of the stocks under its coverage reporting results that were within expectations.  \\u201cPower was the only sector that positively surprised. Sectors that reported both year-on-year (y-o-y) and quarter-on-quarter (q-o-q) growth in core earnings were plantation and consumer. \\u201cSectors that saw both y-o-y and q-o-q weaker core earnings were transport (airlines), oil and gas, property (developers), auto, media and glove,\\u201d it said.  The research house noted that disappointing results from the airline sector were due to a still challenging environment, while the auto sector faced lower volume sales and margin compression on higher advertising and promotions as competition heated up.  \\u201cPockets of disappointment in the consumer-related sector came from weaker consumer sentiment [volume sales were down] and poorer advertising expenditure sentiment [in the] media [sector],\\u201d said Maybank IB.  Among big cap stocks under Maybank IB\\u2019s coverage, whose earnings surprised on the upside were Malaysia Airports Holdings Bhd, Kuala Lumpur Kepong Bhd, Hong Leong Financial Group Bhd, YTL Power International Bhd and Tenaga Nasional Bhd. Stocks that negatively surprised were Malaysian Airline System Bhd (MAS), AirAsia X Bhd (AAX), Bumi Armada Bhd, Guinness Anchor Bhd, Felda Global Ventures Holdings Bhd, Axiata Group Bhd, Telekom Malaysia Bhd and Dialog Group Bhd.  Maybank IB has revised its calls on eight stocks following 1Q earnings season, with one upgrade and seven downgrades, compared with seven upgrades and eight downgrades in the previous quarter.  \\u201cAnn Joo Resources Bhd is now a \\u2018buy\\u2019 due to its limited downside to profitability and the stock is already trading at below trough price-to-book [value] of 0.7 times. Of our seven downgrades, three stocks are now a \\u2018sell\\u2019 \\u2014 MAS, TH Plantations Bhd and NCB Holdings Bhd,\\u201d it said.  Other stocks downgraded to \\u201chold\\u201d from \\u201cbuy\\u201d were Tan Chong Motor Holdings Bhd, AAX, Star Publications (M) Bhd and TSH Resources Bhd. This article first appeared in The Edge Financial Daily, on June 6, 2014."}, "4": {"date_posted": "3/6/2014", "title": "Market Close: KLCI rises 0.5% on US, China factory data", "article": " KUALA LUMPUR (June 3): The FBM KLCI rose 8.3 points or 0.5%, tracking Asian market gains as US and China factory output growth data shore up investor sentiment. At 5pm, the KLCI settled at 1,872.55 as stocks like IOI Corp Bhd and Axiata Group Bhd advanced. \"In Malaysia, it is mostly local institutional investors who supported the stock market,\" a fund manager told theedgemalaysia.com over telephone today. Bursa Malaysia saw 1.2 billion shares worth RM1.97 billion changed hands. There were 395 gainers versus 369 decliners. The top gainer was British American Tobacco (M) Bhd while leading decliners included NPC Resources Bhd and Carlsberg Brewery Malaysia Bhd. The most-active stock was YTL Corp Bhd. Across Asian markets, Japan's Nikkei rose 0.66% while Hong Kong's Hang Seng added 0.91%. Reuters reported that the Nikkei led Asian shares higher on Tuesday, supported by solid U.S. and Chinese manufacturing data, while the euro dragged its feet near a 3 1/2-month low on expectations of fresh monetary easing by the European Central Bank. Japan's Nikkei hit a two-month high and last traded up 0.8 percent while MSCI's broadest index of Asia-Pacific shares outside Japan rose 0.2 percent, nearing a one-year high hit last week."}, "5": {"date_posted": "27/5/2014", "title": "Highlight: Axiata 1Q profit rises 9.8% yoy to RM674.9m on forex gains", "article": " KUALA LUMPUR (May 27): Axiata Group Bhd\\u2019s net profit rose 9.8% year-on-year (y-o-y) to RM674.9 million in the first quarter ended Mar 31, 2014, from RM614.6 million. Revenue rose a marginal 0.7% y-o-y to RM4.51 billion from RM4.48 billion. In a statement to the stock exchange, the telecommunications giant said the higher net profit was mainly due to foreign exchange gains of RM133.3 million recorded by Indonesia this quarter as compared to losses a year ago. Axiata added the higher profit contribution from its Cambodia operations and associate in India also brought positive net profit growth to the group. For the marginally larger revenue, the group said this was attributed to higher revenue contribution from Sri Lanka, Bangladesh and Cambodia. Axiata said at constant currency, the group revenue would have registered a higher growth of 4.1% for its revenue. On the domestic front, Axiata said its local operation reported lower profit due mainly due to lower EBITDA and higher taxation recorded in the reviewed quarter. The group added revenue also decreased mainly due to lower prepaid and interconnect revenue and from lower sales of devices. \\u201cMoving forward, the group will remain focused on its long-term transformation strategy, which includes new approach to current business. We will continue to invest aggressively in data and related services,\\u201d said Axiata. \\u201cWe will also review and improve our cost structure and foreign exchange mitigation strategy in order to optimise our financial performance.\\u201d The group expects to face continued challenges for the financial year ending Dec 31, 2014 and will focus on careful execution of its business strategy. It added amongst the key risks facing operating companies include rising competition and regulatory challenges."}, "6": {"date_posted": "14/5/2014", "title": "Market expected to be bullish this week", "article": " LAST week, I mentioned that the market was hanging in a balance between the bull and the bear, and in the past one week, the bull seemed to be stronger. The FBM KLCI mildly rebounded on strong bullish market performance in the US and rebounds in the regional markets. The KLCI increased only 0.3% in a week to 1,866.08 points on Monday after trading in a range of between 1,853.31 and 1,867.40 points. The index could have closed higher if it was not dragged down by strong selling in Petronas Dagangan Bhd (PetDag). Trading volume remained firm but relatively low compared to the previous months. This is an indication that the market is still being cautious. The average daily trading volume in the past one week was 1.7 billion shares. The average trading value was RM1.9 billion compared with RM1.7 billion two weeks ago, indicating the trading of higher priced stocks. Foreign institutions continued to be net buyers throughout last week. The stronger ringgit may be the catalyst for foreign buying. Net buying by foreign institutions was RM327.2 million while net selling by local institutions and retail investors stood at RM271.2 million and RM56.0 million respectively. In the KLCI, gainers beat decliners 19 to 8. Gainers were led by YTL Corp Bhd (+2.5%), Axiata Group Bhd (+2.2%) and Hong Leong Bank Bhd (+2.2%), while decliners were led by PetDag (-10.6%), CIMB Group Holdings Bhd (-0.8%) and British American Tobacco (Malaysia) Bhd (-0.8%). Markets were directionless last week and this was a sign of cautiousness. Singapore\\u2019s Straits Times Index declined 0.6% in a week to 3,222.43 points on Monday. Hong Kong\\u2019s Hang Seng Index rose 1.3% in a week to 22,261.61 points and China\\u2019s Shanghai Stock Exchange Composite Index also increased 1.3% in a week to 2,052.87 points. The US Dow Jones Industrial Average increased 1% in a week to 16,695.47 points. However, London\\u2019s FTSE100 index increased only 0.4% to 6,851.75 points while Germany\\u2019s DAX increased 1.8% in a week to 9,702.46 points. The US dollar index rebounded strongly last week after the US Federal Reserve committed to continuing to keep interest rates low until the economic growth becomes steady. The US dollar index increased from 79.13 points a week ago to 79.96 points. Commodity Exchange Gold declined only 1.1% in a week to US$1,295.50 (RM4,197.42) an ounce. The New York Mercantile Exchange WTI crude rose 1.2% in a week to US$100.62 per barrel. The ringgit strengthened against the US dollar from 3.26 in the previous week to 3.23. Crude palm oil rebounded mildly, rising only 0.2% in a week to RM2,589 per tonne. The KLCI continued to trade within the support and resistance levels of the triangle chart pattern. The trend was bullish as the index stayed above the short-term 30-day moving average and above the Ichimoku Cloud. The short-term or immediate support level remained at 1,845 points and the immediate resistance level is at 1,870 points. The bullish trend should be able to continue if the index is able to break above the immediate resistance level. The momentum of the bullish trend is steady as momentum indicators like the RSI, MACD and Momentum Oscillator are above their mid-levels. Therefore, there is a high chance for the KLCI to test the resistance level at 1,870 points, thus continuing its uptrend. Furthermore, the Bollinger Bands are steadily expanding upwards and the index is trading above the middle band. If the index is able to break above the immediate resistance level of 1,870 points, it confirms the triangle pattern which has a short-term target at 1,900 points. I am expecting the market to be bullish this week as the technical indicators on the KLCI are being supported well. The index is expected to test this immediate resistance level this week and climb higher in the short term towards 1,900 points, unless there are any reversal indications. If the KLCI fails to break above 1,870 points, then expect it to further consolidate sideways. Daily FBM KLCI chart as at May 12, 2014. Benny Lee is chief market strategist for Jupiter Securities Sdn Bhd. Jupiter Securities is a participating broker in Bursa Malaysia committed to offering the best services to a wide range of customers. He can be contacted at [email\\u00a0protected]. The views expressed in the article are the opinions of the writer and should not be construed as investment advice. Please exercise your own judgement or seek professional advice for your investment decisions. This article first appeared in The Edge Financial Daily, on May 14, 2014."}, "7": {"date_posted": "30/4/2014", "title": "Sukuk: Khazanah said considering $1 billion exchangeable dollar sukuk", "article": " (Apr 30): Khazanah Nasional Bhd., Malaysia\\u2019s sovereign wealth fund, is considering selling as much as $1 billion of dollar-denominated exchangeable Islamic bonds, said four people with knowledge of the deal. The state-owned entity, which was the first in the Shariah- compliant industry to sell such debt in 2006 and also pioneered the issuance of yuan sukuk, is currently choosing banks for the potential offer, said the people who asked not to be identified because the details are private. The notes would be exchangeable into shares of companies controlled by Khazanah, they said. Under a government directive, the fund has been reducing its stakes in Malaysian corporations via Islamic debt offerings that can be converted into shares. The latest sale from Khazanah, which owns about 32 percent of Tenaga Nasional Bhd., the country\\u2019s biggest power producer, and about 29 percent of Telekom Malaysia Bhd., will be its sixth. \\u201cKhazanah\\u2019s sukuk is part of a gradual move to make the Malaysian stock market more liquid,\\u201d Gerald Ambrose, who oversees the equivalent of $2.6 billion as managing director of Aberdeen Asset Management Sdn., said in a telephone interview in Kuala Lumpur. \\u201cDemand for this exchangeable sukuk should be well-received.\\u201d Asuki Abas, a spokesman for Khazanah, couldn\\u2019t be immediately reached for comment via mobile phone or e-mail. Sales Boost The fund last raised S$600 million ($478 million) from five-year exchangeable Islamic debt in October that can be converted into shares of IHH Healthcare Bhd. A decision hasn\\u2019t yet been made on which equities will be included in this offering, the people said. Khazanah also owns 39 percent of telecommunications company Axiata Group Bhd., the biggest shareholder. It has about 103.5 billion ringgit ($31.7 billion) of assets, including a stake in Malaysian lender CIMB Group Holdings Bhd. Khazanah issued the world\\u2019s first Shariah-compliant notes denominated in China\\u2019s yuan in Hong Kong in 2011 and sold S$1.5 billion of five- and 10-year sukuk in Singapore in August 2010. The 2.9 percent Chinese currency bonds due in October 2014 yielded 3.27 percent when last traded on March 12, according to data compiled by Bloomberg. The 2.615 percent Singapore dollar notes maturing in August 2015 were paying 1.32 percent today. Issuance of Islamic bonds in Malaysia, the world\\u2019s biggest sukuk market, has more than doubled this year to 26 billion ringgit, data compiled by Bloomberg show. The Bloomberg-AIBIM Bursa Malaysia Corporate Sukuk Index, a benchmark that tracks the most-traded local-currency notes, dropped 0.3 percent in 2014 to 104.80, after gaining 2.8 percent last year."}, "8": {"date_posted": "15/4/2014", "title": "Net money inflow into Malaysia for three consecutive weeks", "article": " KUALA LUMPUR: Foreign funds bought listed Malaysian equity for the third week running last week, a positive development in the local equity market since October 2013.  According to MIDF Research, foreign funds bought RM414.4 million worth of Malaysian stocks in the week ended April 11, significantly higher than the RM107.7million purchased the week before (April 7), but lower than RM832.7 million for the week ended March 28. \\u201cForeign investors\\u2019 optimism is reflected by the fact that they were net buyers every single trading day last week. The amount bought hit RM195.5 million on Monday, the third highest in a day this year. \\u201cIt tapered on Tuesday but buying remained steady throughout Wednesday to Friday, despite the upheavals on Wall Street and in Europe with respect to the tech sell-off, and the election outcome in Indonesia,\\u201d MIDF analyst Zulkifli Hamzah said in the research house\\u2019s fund flow report for the week ended April 11. The KLCI was strongly supported last week and closed above 1,850 for the third week in a row at 1,852.7 points. MIDF said the foreign participation rate remained elevated last week, with the average daily foreign participation rate at RM1.05 billion. Axiata Group Bhd recorded the highest net money inflow totalling RM3.23 million. Its share price, however, retreated 1.04% for the week in tandem with the broader market decline.  Oriental Holdings Bhd was the foreign funds\\u2019 second favourite stock last week, with a net inflow of RM2.43 million. Its share price rose 5.75% week-on-week despite the softer broader market, with its trade volume jumping to 4.41million units from a two-year weekly average of only 1.24 million units.  KPJ Healthcare Bhd attracted the third highest net money inflow of RM2.24million. Buying interest returned midweek, which catapulted the stock to close 8.39% higher during the review week.  Among the top money outflows were IJM Corp Bhd (-RM20.8 million), AMMB Holdings Bhd (-RM19.67 million), CIMB Group Holdings Bhd (-RM13.95 million), Malaysia Airports Holdings Bhd (-RM10.75 million), and Telekom Malaysia Bhd (-RM10.72 million). Zulkifli said despite the reported surplus in the flow of funds in the last three weeks, Malaysia remained in the red for 2014. The year\\u2019s cumulative net withdrawal from Malaysian equity amounted to RM5.55 billion as of last week. However, this was a 20% reduction from the cumulative peak of RM6.9 billion. Zulkifli said Wall Street remains the world\\u2019s bellwether market for equity. \\u201cCurrently, the market in the US is in the process of \\u201cunwinding\\u201d, with prices retracing amid the occasional thematic sell-off, such as that witnessed last week with the technology sector rout.\\u201d He is cautious over the impact of Wall Street activity. \\u201cThe earnings reporting season for 1Q14 financials may turn unsavoury if many companies\\u2019 reports fall behind expectations. The sell-off of technology stocks last week, amid worries over earnings, is probably a taste of things to come. The market is heading into May, which is historically not a good month for Wall Street.\\u201d  He said uncertainty on Wall Street may be the catalyst for funds to hunt for value elsewhere, and Asia appears to be a prime target as seen by the flow of fund data in the past few weeks. However, the risk of a reversal also heightens, said Zulkifli. This article first appeared in The Edge Financial Daily, on April 15, 2014."}, "9": {"date_posted": "14/4/2014", "title": "Interview: Telekom eyes No 1 top spot in converged world", "article": " SIX years after demerging its mobile operations into Axiata Group Bhd, the country\\u2019s fixed-line operator Telekom Malaysia Bhd see ms to be back-pedalling by acquiring control of niche fourth-generation (4G) mobile spectrum holder Packet One Networks (M) Sdn Bhd (P1).  Telekom shares slumped 6% over five days after the March 27 announcement that essentially quashed hopes of more special dividend payments in the near term. In addition, start-up losses from the 57% stake in P1 would eat into earnings as Telekom moves into the space where three dominant mobile-phone operators are already finding it tough to grow, observers say.  Telekom\\u2019s group CEO Tan Sri Zamzamzairani Mohd Isa contests this view. \\u201cTM will never be No 4 in anything,\\u201d says a bemused Zamzamzairani on the notion of his company playing fourth fiddle to Malaysia\\u2019s \\u201cbig three\\u201d mobile operators: Maxis Bhd, DiGi.Com Bhd and its former unit Celcom Axiata Bhd.  \\u201cWe want to be No 1 in terms of providing converged services \\u2014 that\\u2019s very different [from TM playing catch-up with the big three]. People look at us as another mobile player but we are not [adding mobility in isolation]. We\\u2019re a converged player focused on giving the best experience to our customers,\\u201d he tells The Edge.  Telekom\\u2019s decision to add wireless mobility to its traditionally fixed line-centric portfolio may not be that different from a mobile-phone operator like Maxis offering its customers a wireline home phone and broadband to sell more services to existing customers. After all, consumers are increasingly accessing the Internet using mobile phones and tablets, thanks to high-speed Internet on-the-go. \\u201cProviding connectivity alone is not enough\\u2026 Looking at the changing behaviour of customers, if we only remain in that same space, we will get further and further away from the end-user. That\\u2019s why we need to move towards enhancing the user experience with content, devices and apps \\u2014 what we call the innovation exchange,\\u201d Zamzamzairani says, relating Telekom\\u2019s desire to offer an end-to-end suite of services to individuals as well as corporate and enterprise customers.  \\u201cIt\\u2019s about life made easier for our customers, business made easier for our corporate customers. That\\u2019s not just our tagline but how we must approach the market [to win and retain customers]. Technology is no longer a differential because anyone with money can buy technology, which is changing every day.\\u201d  The lack of a differential in quality of service means that users are likely to choose a service provider that gives the best value and customer experience, industry experts say.\\u00a0 This realisation has made it easier for telecoms operators to share network infrastructure \\u2014 something unheard of in the mid-2000s when network coverage strength was still used as a selling point to woo mobile-phone customers.  Similarly, Telekom is recouping its RM8.9 billion investment in its HSBB network faster by selling wholesale capacity to rivals. Old timers would remember the reluctance displayed by Telekom, in its old incarnation, towards \\u201cequal access\\u201d, which would allow rivals to piggyback\\u00a0 on \\u201cthe local loop\\u201d to provide the old-school fixed-line phone service.  While the government made Telekom promise to open the HSBB network to any local licensed provider when RM2.4 billion worth of public funds went into building Phase 1 of the RM11.3 billion HSBB network, some experts think it is Telekom\\u2019s control over this trunk wired fibre network that gives it an edge over the local mobile giants.  \\u201cIt is easier for the fixed-line player to move into mobile, not the other way around,\\u201d says a telecoms analyst, explaining how wireless network is relatively faster and cheaper to roll out.  Zamzamzairani admits as much: \\u201cBecause we are strong in [backhaul fixed line] infrastructure, we have greater control over the end-to-end experience.\\u201d While Telekom is open to more acquisitions to improve its service portfolio, he says the company is more likely to make \\u201copportunistic\\u201d purchases rather than actively seeking out targets.  \\u201cNo 1 doesn\\u2019t mean we have to own everything. We can fill gaps through collaborations like P1 or tie-ups with other players as well,\\u201d he says, adding that enterprise services and business process outsourcing (BPO) are among areas Telekom would like to further strengthen.  For now, the focus is to sort out details of the P1 collaboration, which gives Telekom the right to name the latter\\u2019s CEO. With access to P1\\u2019s 50MHz spectrum in the 2.3GHz and 2.6GHz bands for the 4G-Long Term Evolution (LTE) rollout, TM can make greater use of its spectrum in the lower 450MHz and 850MHz bands that have wider coverage capabilities versus the higher capacity to carry data in the higher bands.  \\u201cWhat TM needs now is permission to use the 850MHz spectrum nationwide, beyond the universal service provision (USP) coverage [in rural areas],\\u201d a telecoms analyst says, drawing comfort from the fact that the Malaysian government has hitherto chosen not to charge high spectrum fees to encourage wider rollout.  Zamzamzairani is convinced that Telekom can make a strong case to ask for continued usage of the 850MHz spectrum for nationwide LTE rollout when the spectrum is up for renewal next year. This would allow Telekom to also offer mobile-phone services, on top of wireless broadband.  The other big-ticket item is the outcome of negotiations on the government\\u2019s co-investment in Phase 2 of the HSBB network rollout announced in Budget 2014 last September. Zamzamzairani says it is premature to give any guidance on capital expenditure as negotiations are still ongoing but is \\u201chopeful\\u201d of concluding talks by year-end.  Instead, he points out the strength of Telekom\\u2019s balance sheet to meet the potential rise in capex needs as well as keep its promise to pay a minimum annual dividend of RM700 million.\\u00a0 \\u201cPeak funding was some RM2.7 billion in 2010, when capital needs for HSBB were at their peak\\u2026 We\\u2019re not a start-up. Today our revenues are much stronger\\u2026\\u00a0 We have said there is no change in our dividend policy and we have many other levers [to pull],\\u201d Zamzamzairani says when pressed for details.  \\u201cYou\\u2019re right that this [change in direction] is a chance to review [the dividend policy] but I can tell you that this is not being considered,\\u201d he adds.  Time will tell if the scenario will change should Telekom\\u2019s stake in P1 rise substantially.\\u00a0According to the terms of the planned RM210 million convertible bonds issuance by Green Packet Bhd, Telekom could end up taking over the latter\\u2019s entire 30% stake in the enlarged P1 if Green Packet defaults on the debt papers. This would raise TM\\u2019s stake from 57% to 87%, leaving South Korea\\u2019s leading LTE operator SK Telekom with a 13% stake. As it is, TM is taking up 60% or RM990 million of P1\\u2019s planned RM1.65 billion convertible bonds to raise cash for network rollout over the next three to five years. For now, Standard & Poor\\u2019s credit analyst Mehul Sukkawala says Telekom\\u2019s credit rating is unaffected by its investment in P1 and the LTE rollout, which is expected to raise debt-to-Ebitda levels to about two times over the next two to three years from 1.7 times in 2013. \\u201cEven then, the ratio is likely to remain significantly below our downgrade rating trigger of close to 2.5 times,\\u201d the analyst writes in an April 3 note. Analysts polled on Bloomberg seem split over TM\\u2019s stock performance for the coming 12 months, with eight \\u201cbuys\\u201d versus 12 \\u201cholds\\u201d and 10 \\u201csells\\u201d and price targets ranging from RM4.80 to RM7.22. Using its current share base, yield was 3.36% at last Thursday\\u2019s RM5.83 close, based on its minimum RM700 million, or 19.57 sen per share, dividend payout. That could limit upside for the stock, although analysts agree that strategic assets are rarely ever cheap. Asked on the naysayers, Zamzamzairani said many doubted the HSBB\\u2019s potential when the idea was mooted in 2008 \\u2014 the reason a minimum dividend was promised to reward investors who stuck on during the lower earnings and high expenditure days. \\u201cToday, HSBB take-up is greater than we thought. Who would have thought that after only three-plus years, take-up rate would be 43%?\\u201d  He, for one, has no doubt that Telekom has \\u201call the important pieces\\u201d of the puzzle to regain the dominance it once enjoyed. Does this mean it is a matter of time before Telekom\\u2019s stock moves back to Malaysia\\u2019s top three position \\u2014 just like in the early 2000 when the so-called TMT (Telekom-Maybank-Tenaga) stocks were the bluest of the Malaysian blue chips?  \\u201cWe\\u2019re not after the top market-cap position per se but it is more of providing customers with the best experience\\u2026 I would say that TM is in the best position to deliver an end-to-end service proposition as we have all the pertinent pieces to play with\\u2026 ARPUs [average revenue per user] are rising, so we must be doing something right.\\u201d This story first appeared in The Edge Malaysia Weekly Edition, on April 7 - April 13, 2014."}, "10": {"date_posted": "8/4/2014", "title": "Market Close: KLCI falls on banking, telco stocks; regional markets rise", "article": " KUALA LUMPUR (Apr 8): The FBM KLCI fell, led by banking and telco stocks. But there were rises in regional markets. At market close today, the FBM KLCI fell 10.59 points or 0.57% to settle at 1852.31 on the back of falling stocks such as Public Bank, CIMB, Axiata, Digi and Sapura Kencana. The market saw trades of 1.89 billion shares worth RM2.08 billion. The market had stayed in the negative territory for the entire day amid bearish sentiment, with decliners leading gainers by 424 to 389. \\u00a0 Choo Swee Kee, Chief Investment Officer at TA Investment Management Bhd, told theedgemalaysia.com that the local funds were neutral on the market today as there are no major catalysts on the horizon. \\u201cThere were some foreign funds coming into the Asia Pacific market, but not into Malaysia. One reason (for the fall) could be that on comparative valuation, Malaysia is considered a premium compared to regional markets,\\u201d Choo said. The top gainer today was Ecoworld, which saw a 43 sen gain. The top decliner was Dana Infra, which lost 99 sen. The most active stock was Symphony. In the region, most Asian markets rose to shrug off early losses. Reuters reported that the market had risen, helped by Chinese shares rising sharply on stimulus hopes, though Japanese equities slumped as the yen clung to its gains after the Bank of Japan held policy steady. The Kospi rose 0.17% to 1993.03 and the Hang Seng gained 0.98% to 22596.97. The Nikkei 225 fell 1.36% to 14606.88"}, "11": {"date_posted": "31/3/2014", "title": "All depends on turning around P1", "article": " SPECULATION over the sale of Packet One Networks (M) Sdn Bhd (P1), which has been swirling for some time, finally came to an end last week, with Telekom Malaysia Bhd emerging as the new strategic partner for the WiMAX operator. Investor reaction was, however, tepid. Shares for Green Packet Bhd closed down 9.6% at 47 sen last Friday.  Recall that its share price surged as high as 64 sen in October on speculation of an imminent sale of its 55% stake in P1. Meanwhile, the share price for Telekom closed down 4.3% at RM5.93. The lukewarm reaction is understandable. Telekom will inject cash into P1 and recharge its expansion plans, which have slowed significantly over the past year. But that in itself is no guarantee of success in the very competitive telco sector. No cashing out for Green Packet Shareholders of Green Packet are likely disappointed that the much talked about sale values P1 at less than when a 25.8% stake was sold to SK Telecom for US$100 million (RM327 million) back in 2010. Telekom is now paying \\u201conly\\u201d RM350 million for a 57% equity stake in the WiMAX operator.  More importantly, Telekom\\u2019s 57% stake comes from the issuance of new shares by P1. This means that Green Packet does not get a share of the RM350 million proceeds but its stake will be diluted to 30% based on the enlarged share capital of P1.  Having said that, Green Packet will get some cash flow \\u2014 from the issuance of RM210 million worth of redeemable exchangeable bonds to Telekom. The first tranche for RM120 million should be issued later this year with the balance likely in 2015.  Save for some RM30 million that will be used to acquire P1 shares held by minority shareholders, the remaining proceeds can be utilised by Green Packet for settlement of liabilities and working capital. (Telekom can swap the bonds for Green Packet\\u2019s shares in P1 in five years\\u2019 time, if they are not redeemed.)  But given that Green Packet will also subscribe for 15% of the RM1.65 billion redeemable convertible bonds to be issued by P1 \\u2014 equivalent to roughly RM248 million \\u2014 over the next three years, it is unlikely there will be any special payout to shareholders from this whole exercise. This means that Green Packet shareholders will have to continue to be patient. Instead of cashing out, shareholders will have to wait for P1\\u2019s turnaround. In the meantime, the company will likely remain in the red with limited chance for dividends. We have previously mentioned that Green Packet may well want to retain a stake in P1 (article published Oct 16, 2013). The broadband business is its primary thrust going forward unless the company decides on a major strategic change. Its other businesses, the devices unit is very competitive and marginally loss-making while margins for the communications unit are wafer thin with limited prospects. But it is sorely in need of a game changer if it is to turn the company around. Getting Telekom onboard is potentially that game changer. Cash infusion to recharge P1\\u2019s expansion plans One of P1\\u2019s greatest obstacles was the limits of its balance sheet. Unlike deep-pocketed YTL Communications, which could afford a nationwide rollout, P1 has always been very cautious in expanding, adding sites and capacity only in lock-step with demand. We estimate total capital expenditure (capex) spent to date, since 2007, at just about RM1 billion. This rollout model works quite well for the home broadband business. Gradually expanding coverage in the later years allowed P1 to launch limited nomadic broadband services but its roughly 55%-60% coverage is too low to offer nationwide mobile broadband services.  To compete fully in the 4G mobile services market, P1 would need nationwide coverage \\u2014 at least 80% to compete with the likes of Maxis Bhd, Celcom Axiata Bhd and DiGi.Com Bhd. That means substantially more capex, which would be difficult without corresponding improvement in revenue and cash flow. P1 generated RM306 million revenue in 2013 with operating earnings (before depreciation, interest and tax) of just RM38 million and net loss of RM116 million. With Telekom in the picture, P1 is slated to raise RM2 billion in fresh capital \\u2014 RM1.65 billion in convertible bonds and RM350 million from new shares issued to Telekom \\u2014 to fund its LTE network rollout for the next three years. Telekom and SK Telecom will subscribe to 60% and 25% of the bonds while Green Packet will take up the remaining 15%.  Even so, there is no guarantee of P1\\u2019s turnaround. The LTE-space is extremely competitive and dominated by Maxis, Celcom and DiGi while smaller players like U Mobile and YTL Communications also jostle for a share of the already saturated market. And then, there is newcomer Altel Communications, which is owned by tycoon Tan Sri Syed Mokhtar Al-Bukhary. P1 a risky bet for Telekom As such, the investment could be a risky one for Telekom. The company has been doing well, focusing on the home broadband market segment that is driven by good take up for its UniFi services. With this proposed acquisition, gearing will rise and earnings in the near to medium term will be hurt by higher interest expenses and consolidation of P1\\u2019s losses \\u2014 probably by between 10%-20% from current earnings estimates.  At the prevailing price, the stock is trading at roughly 22 times our estimated earnings for the current year with net yield of 4.4%. With flattish to slightly negative earnings growth likely for the next year or two, at least, Telekom\\u2019s valuations do not appear attractive. Whether the acquisition turns out to be value accretive depends on P1\\u2019s success over the longer term. Note: This report is brought to you by Asia Analytica Sdn Bhd, a licensed investment adviser. Please exercise your own judgment or seek professional advice for your specific investment needs. We are not responsible for your investment decisions. Our shareholders, directors and employees may have positions in any of the stocks mentioned. This article first appeared in The Edge Financial Daily, on March 31, 2014."}, "12": {"date_posted": "28/3/2014", "title": "Window dressing activities in 1Q14", "article": " MAJOR Asian markets except China closed higher yesterday, reversing earlier losses as global market sentiment remained mixed after weighing between an improving global outlook and on concern that tension in Ukraine may escalate. American markets fell on Wednesday night, led down by a softer technology sector (via weakness in King Digital Entertainment\\u2019s initial public offering and Facebook). The SP 500 index fell 13.06 points to close at 1,852.56 points while the Dow tumbled 98.89 points to end at 16,268.99 on Wednesday night. The FBM KLCI traded in a firmer range of 25.84 points for the week with higher volumes of 1.94 billion to 2.08 billion shares done. The index closed at 1,846.87 yesterday, up 7.73 points from the previous day as blue-chip stocks like Axiata Group Bhd, IOI Properties Group Bhd, Petronas Dagangan Bhd, RHB Capital Bhd and UMW Holdings Bhd caused the index to move up on late local first quarter of 2014 (1Q14) window dressing activities yesterday. The index rose on a rally from the 801.27 low (October 2008) to the previous 1,826.22 all-time high (May 2013) and it represents an extended Elliott Wave \\u201cFlat\\u201d rebound in a \\u201cPseudo-Bull\\u201d rise completed. The price movements in the index in the next few months following May 2013 were trapped in a rangy consolidation with key swings of 1,723.74 (low), 1,811.65 (high), 1,660.39 (low), 1,805.15 (high), 1,759.66 (low), 1,882.20 (high), 1,769.80 (low), 1,838.69 (high) and 1,802.88 (low). The index\\u2019s daily signals (like CCI, DMI, MACD, Stochastic and Oscillator) are all positive. As such, its firm support levels are seen at 1,802, 1,820 and 1,846, while the resistance areas of 1,849, 1,852 and all-time high of 1,882 will witness some very heavy selling. Our rebound retracement target of 1,839.26 (62% level) had capped the index on March 6. However, the 1Q14 window dressing activities late this month have caused the index to break above that key level. Thus, we may visit upside targets of 1,871 and 1,882 in the\\u00a0 medium term yet again. Its simple moving averages (MA) depict an emerging uptrend for its daily, weekly and monthly charts. Due to its firmer chart signals, we believe investors will continue to adopt a \\u201cbuy on dips\\u201d philosophy for the KLCI. Due to the firmer tone for the KLCI, we are recommending a chart \\u201cbuy\\u201d on Inari Amertron Bhd, which broke above the RM1 billion market capitalisation mark on March 7 after our weekly write-up in October 2013 when the market capitalisation was just about RM560 million. The strong rise in the stock can be attributed to investor optimism on its future earnings potential as well as the potential transfer to the Main Market of Bursa Malaysia. For 2Q ended Dec 31 of financial year 2014 (2QFY14), Inari\\u2019s profit before tax (PBT) improved significantly to RM26.6 million from RM11.3 million in 2QFY13. The improved profitability was attributed to the increase in revenue, strong US dollar and favourable gold prices during the period as well as consolidation of revenue and profit generated by the newly acquired Amertron Group. Going forward, Inari expects rising demand to contribute positively to its outlook, as demand for smartphones and tablet computers is expected to grow further in the near term. A check on Bloomberg consensus reveals that only one research house has coverage on the stock, with a \\u201cbuy\\u201d call. The stock is currently trading at a fair historical price-earnings ratio of 14.8 times but a high price-to-book value of 5.9 times. Inari has a fair indicative 12-month dividend yield of 2.29%. Inari\\u2019s chart trends on the daily, weekly and monthly time frames are very strong. Its share price made an obvious surge since its weekly Wave-2 low of 37 sen in March 2013. Since that 37 sen low, Inari surged to its recent March 2014 high of RM2.87. Its chart has moved into very strong daily, weekly and monthly uptrends to its recent March 2014 high of RM2.87. As it broke above its recent key critical resistance levels of RM2.31 and RM2.54, look to buy Inari on any dips to its support areas as the moving averages depict very firm short to medium term uptrends for this stock. The daily, weekly and monthly indicators (like the CCI, DMI, MACD and Oscillator) are very positive and now depict the obvious indications of Inari\\u2019s eventual move towards much higher levels. We expect Inari to remain very well sought after on dips towards its support levels of RM2.31, RM2.54 and RM2.78. It may attract minor profit taking at the resistance levels of RM2.85 and RM2.87. Its upside targets are now located at RM3.31, RM3.69, RM3.82 and RM4.51. This article first appeared in The Edge Financial Daily, on March 28, 2014."}, "13": {"date_posted": "27/3/2014", "title": "Telecoms sector PER likely to narrow in FY14", "article": " Telecommunications sectorMaintain neutral: All the local telecommunications players posted results that came in within expectations, except for two outperformers, Telekom Malaysia Bhd and DiGi.com Bhd. TM\\u2019s performance was mainly due to a tax incentive while DiGi was fuelled by stronger uptake of its mobile Internet service and better cost efficiencies. Axiata Group Bhd\\u2019s short-term outlook remains challenging due to the integration costs of its Indonesian subsidiary, PT XL Axiata Tbk\\u2019s acquisition of PT Axis Telekom Indonesia, and continued currency fluctuations in all its key regional operations. Maxis Bhd, on the other hand, continued to be lacklustre, as expected, due to its ongoing business transformation plan. The telco sector\\u2019s price-earnings ratio (PER) has a strong correlation with dividend payout rather than the risk-free rate. Based on our consensus dividend payout and yield spread studies, the sector\\u2019s PER has a stronger correlation of 93% with the dividend payout in contrast to -58% correlation with the Malaysian government securities (MGS) 10-year yield. Our findings also showed that the sector\\u2019s PER is likely to be narrowed in financial year 2014 (FY14). Maxis\\u2019 FY14 PER is expected to be narrow while both Telekom and Axiata\\u2019s PER are likely to widen. DiGi\\u2019s PER direction in FY14 is seen to be mixed. As at end-FY13, the smartphone penetration rates for Maxis, Celcom Axiata Bhd and DiGi stood at 56%, 38% and 38.1% respectively, which suggest room for growth in the future. Competition in the fibre-to-the-home (FTTH) segment will likely ease following the review of its home segment by Maxis. We are maintaining our \\u201cneutral\\u201d call on the telecommunications sector. While the data segment remained the key focus for all the celcos, they are also likely focus on spurring smartphone penetration rate through entry-level smartphones as well as widening network coverage in FY14. Our 1QFY14 stock pick, TM, has advanced by 10.1% year-to-date (as at March 25, 2014), outperforming the sector (-0.1%) and KLCI (-1.0%) for the same period. In view of TM\\u2019s current share price which is trading above our target price, we have downgraded the stock to \\u201cmarket perform\\u201d from \\u201coutperform\\u201d. Despite the lower rating, TM (target price [TP]: RM6) remains our top pick for the sector due to: (i) its solid presence in the FTTH market; (ii) the milder competition in its wholesale and fixed-line segments; and (iii) it potentially bagging the second phase of the high speed broadband (HSBB) project, which could lead the company to use the prospective savings in capital expenditure (or government grant) to reward its shareholders. If we are to assume that TM bags the project, we estimate that the government grant could come in at 20% to 25% (or RM360 million to RM450 million, representing 10 sen to 12.6 sen per share), which is similar to the quantum the company received for Phase 1 of the HSBB project. DiGi\\u2019s stock rating has also been lowered to \\u201cmarket perform\\u201d after it advanced by 8.1% YTD and is now trading slightly above our TP of RM5.24. There is no change to our \\u201cmarket perform\\u201d call on both Maxis (TP: RM7.10) and Axiata (TP: RM6.57). \\u2014 Kenanga Research, March 26 This article first appeared in The Edge Financial Daily, on March 27, 2014."}, "14": {"date_posted": "21/3/2014", "title": "KLCI shows eventual softness to 1,800", "article": " ASIAN markets were lower yesterday, as China\\u2019s Shanghai Composite Index lost ground (1.4%) after Goldmans Sachs lowered its growth forecast to 7.3% from 7.6%.\nRegional markets roiled further as the US Fed stated that it would press on with ongoing cuts to its bond-buying programme and switch to quantitative guidance for assessing interest rates. The SP 500 index fell 11.48 points to close at 1,860.77 points while the Dow tumbled 114.02 points to end at 16,222.17 on Wednesday night.\nThe FBM KLCI traded in a narrow range of 18.45 points for the week with lower volumes of 1.21 billion to 1.52 billion shares done. The index closed at 1,818.17 yesterday, up a mere 0.73 of a point from the previous day as blue-chip stocks like Axiata Group Bhd, IOI Properties Group Bhd, Petronas Dagangan Bhd, RHB Capital Bhd and UMW Holdings Bhd caused the KLCI to inch up on late local nibbling activities.\nThe index rose on a rally from the 801.27 low (October 2008) to the previous 1,826.22 all-time high (May 2013) and it represented an extended Elliott Wave \\u201cFlat\\u201d rebound in a \\u201cPseudo-Bull\\u201d rise completed. The index\\u2019s price movements in the next few months following May 2013 were trapped in a rangy consolidation with key swings of 1,723.74 (low), 1,811.65 (high), 1,660.39 (low), 1,805.15 (high), 1,759.66 (low), 1,882.20 (high), 1,769.80 (low) and 1,838.69 (high).\nThe index\\u2019s daily signals (like CCI, DMI, MACD and Oscillator) are mainly negative except the Stochastic. As such, the index\\u2019s weaker support levels are seen at 1,769, 1,802 and 1,811, while the resistance areas of 1,818, 1,838 and all-time high of 1,882 will witness some very heavy selling activities.\nOur rebound retracement target of 1,839.26 (62% level) capped the index on March 6, 2014. As the index could not penetrate above this key level, it has thrown the KLCI\\u2019s onus to the downside, with critical supports of 1,802 and 1,800 in focus again.\nIts simple moving averages (MA) depict a downtrend for its daily chart, while the weekly chart is neutral. Due to its weaker chart signals, we believe investors will continue to adopt a \\u201ctake profit on rallies\\u201d philosophy for the KLCI.\nDue to the softer tone for the KLCI, we are recommending a chart \\u201csell\\u201d on Supermax Corp Bhd. Despite being a RM1.8 billion market capitalisation company, Supermax is one of the smaller listed rubber glove manufacturers.\nIt has outperformed its peers on a year-to-date basis. It had hoped that a weakening ringgit against the US dollar would translate to better earnings but its recent results were mostly below analysts\\u2019 expectations.\nSupermax\\u2019s profit before tax for the fourth quarter ended Dec 31 of financial year 2013 (4QFY13) fell to RM37 million from RM39.5 million in 4QFY12. Since then, the stock has been seeing some obvious selling pressure.\nAccording to the company, the weaker profitability was due to lower selling prices as well as a temporary loss of production output due to a fire. However, 50% of the production lines affected by the fire have already been operational since mid-January and the remaining lines could be operational by end-March.\nWith this, investors may be cautious ahead of the 1QFY14 results due out sometime before May.\nMaybank-IB does not cover this stock. A check on Bloomberg consensus reveals that 11 other brokers cover the stock. Out of the 11, four have \\u201cbuy\\u201d calls, one has a \\u201csell\\u201d call while six have a \\u201chold\\u201d rating. The stock is currently trading at a historical price-earnings ratio of 14.1 times and a high profit-to-book value of 2.03 times.\nSupermax\\u2019s price trends on the daily chart are weaker. Its share price made an obvious decline since its recent daily Wave-5 high of RM3.08 on Feb 11. Since the RM3.08 high, it declined to its recent March low of RM2.59.\nIts chart has moved into an obvious daily downtrend to its recent March low of RM2.60. As it broke below its recent key critical support levels of RM3.00 and RM2.87, look to \\u201csell\\u201d Supermax on any rallies to its resistance areas as the moving averages depict very firm short to medium term downtrends for this stock. The daily indicators (like the CCI, DMI, MACD and Oscillator) are very negative and now depict the obvious indications of Supermax\\u2019s eventual move towards much lower levels.\nWe expect it to remain weaker towards its support levels of RM2.31, RM2.45 and RM2.59. It will attract heavy liquidation at the resistance levels of RM2.60, RM2.87 and RM3.00. Its downside targets are now located at RM2.49 and RM2.31.\nLee Cheng Hooi is the regional chartist at Maybank Kim Eng. The views expressed in the article are the opinions of the writer and should not be construed as investment advice. Please exercise your own judgment or seek professional advice for your investment decisions. Technical report appears every Wednesday and Friday. This article first appeared in The Edge Financial Daily, on March 21, 2014."}, "15": {"date_posted": "10/2/2014", "title": "Axiata unit\\u2019s net profit within expectations", "article": " Axiata Group Bhd(Feb 7, RM6.49)Maintain hold with a target price of RM7.05. On the back of a turnover of 21,350 billion rupiah (RM6.03 billion), the group\\u2019s Indonesian unit PT XL Axiata Tbk\\u2019s FY13 core net profit of 1,809 billion rupiah came in within expectations, accounting for 97.8% of consensus\\u2019 full-year forecast. Year-to-date, revenue was flat with data and value-added services (VAS) the fastest growing segments with double digit growth of 16% and 34% respectively, while voice and SMS declined by 7% and 4% respectively. Non-voice revenue contributed 54% (+4ppt year-on-year [y-o-y]) of XL\\u2019s total usage revenue. Financial year 2013 ended Dec 31 (FY13) earnings before interest, tax, depreciation and amortisation (Ebitda) decreased 11% y-o-y while margin contracted from 46% to 41% largely due to, among others, the introduction of SMS interconnect. XL recorded 60.5 million subscribers or 32% increase year-on-year (y-o-y). Data and VAS experienced sustainable exponential growth increasing 142% y-o-y and reaching 54,615 terabyte per annum. Data subscribers reached 33 million or about half of the total subscriber base. Data has remained the fastest growing service in FY13 with its contribution to overall sales increasing from 20% to 23%. Catalysts for Axiata Group include higher smartphone penetration boosting data average revenue per user, strong growth in low penetration developing markets and more cost savings from collaboration with DiGi.Com Bhd. Risks include regulatory risks, foreign exchange fluctuations and competitive risks. Despite the challenging environment, Axiata\\u2019s main operating companies (Celcom Axiata Bhd, XL and Dialog Axiata Plc in Sri Lanka) continue to execute well. Maintain \\u201chold\\u201d call on the stock with unchanged sum-of-parts target price of RM7.05. \\u2014 HLIB Research, Feb 7 This article first appeared in The Edge Financial Daily, on February 10, 2014."}, "16": {"date_posted": "24/1/2014", "title": "Midday Market: KLCI remains in negative territory as regional markets sag ", "article": " KUALA LUMPUR (Jan 24): The FBM KLCI remained in negative territory at the midday break on Friday ahead of the holiday shortened trading next week to observe the Chinese New Year festival as all as in line with the soggy regional markets. At 12.30pm, the benchmark index fell 4.85 points to 1,803.46. The index had earlier fallen to its intra-morning low of 1,798.57. Bears were in control with losers leading gainers by 456 to 185, while 274 counters traded unchanged. Volume was 784.03 million shares valued at RM851.23 million. The top losers included KLK, Dana Infra, BAT, Hong Leong Capital, HLFG, PPB, Genting Plantations, Cahya Mata Sarawak and Daya Materials. Iris Corp was the most actively traded counter with 69.42 million shares done. The stock rose 3 sen to 41 sen. The other actives included Tiger Synergy, SILK Holdings, XDL, Kretam, Sumatec, Daya Materials and KNM. The gainers included United Plantations, CIMB, The Store, Nestle, PBA, Bumi Armada, Hong Leon Industries, JobStreet, Gas Malaysia and Axiata. Maybank IB head of retail research and chief chartist Lee Cheng Hooi in\\u00a0 note to clients Friday said the FBM KLCI\\u2019s resistance level of 1,808 and 1,838 would cap market gains, whilst weaker support levels were at 1,790 and 1,803. \\u201cWe recommend a \\u201cSell on Rallies\\u201d stance for the index. \\u201cDue to the softer US performance, we expect the FBMKLCI to be much weaker as the index tests 1,800 and below today on foreign selling. We expect an imminent waterfall decline very soon for the index,\\u201d he said. Elsewhere, Asian shares lurched to a 4-1/2 month low on Friday, extending the previous day's weakness as disappointing Chinese manufacturing data raised concerns over the economy, and investors sought safety in gold and the yen, according to Reuters. MSCI's broadest index of Asia-Pacific shares outside Japan fell 0.5 percent, adding the previous session's 1.3 percent decline following the Chinese factory activity report, it said. Elsewhere, Asian shares were off-colour on Friday, extending the previous day's weakness as disappointing Chinese manufacturing data raised concerns over the economy, and investors sought safety in gold and the yen, according to Reuters. MSCI's broadest index of Asia-Pacific shares outside Japan slipped 0.1 percent, having fallen 1.3 percent in the previous session to a 4-1/2 month low following the Chinese factory activity report, it said."}, "17": {"date_posted": "24/1/2014", "title": "Mid-morning Market: KLCI falls 0.46% as consolidation persists ", "article": " KUALA LUMPUR (Jan 24): The FBM KLCI fell 0.46% at mid-morning on Friday, as consolidation persisted ahead of the Chinese New Year festival next week. At 10am, the benchmark index fell 8.29 points to 1,800.02, weighed by select blue chips including KLK, Petronas Dagangan and Genting. Bears were in control with decliners leading advancers by 324 to 115, while 204 counters traded unchanged. Volume was 307.75 million shares valued at RM275.08 million. The top losers included KLK, Hong Leong Capital, PPB, HLFG, Petronas Dagangan, Zhulian, Lafarge Malaysia, LPI Capital, Genting and Cahya Mata Sarawak. Iris Corp was the most actively traded counter with 29.57 million shares done. The stock rose 1.5 sen to 39.5 sen. The other actives included SILK Holdings, Daya Materials, KNM, DVM and Bright Packaging. The gainers included United Plantations, Southern Acids, Genting Plantations, BAT, CIMB, NCB, Axiata, IJM Corp and Mintye. BIMB Securities Research in a note Friday said the drop in China\\u2019s manufacturing caused European and Wall Street to end sharply lower as investors were selling resource stocks and emerging-markets assets and seek safety in bonds, gold, and high-dividend paying sectors. The DJIA and S&P500 fell 1.08% and 0.89% respectively to end at 16,197.35 and 1,828.46 respectively. Nevertheless, the research house said China\\u2019s central bank announced it was injecting more liquidity into the system ahead of the Lunar New Year holiday. It said that in Asia, key regional indices ended lower due to the abovementioned reason as well. BIMB Securities said the local market was also affected by the regional selldown as well as the FBMKLCI shredded 5.79 points to end at 1,808.31 with losers led by banking and telco counters. \\u201cTrading participation shows net selling by foreign institutions while local retail and institutions were net buyers. \\u201cWe expect the local market to remain on consolidation stage due to lack of fresh catalysts and expect to see immediate support at 1,805 followed by the critical level of 1,800,\\u201d it said. Elsewhere, Asian shares were off-colour on Friday, extending the previous day's weakness as disappointing Chinese manufacturing data raised concerns over the economy, and investors sought safety in gold and the yen, according to Reuters. MSCI's broadest index of Asia-Pacific shares outside Japan slipped 0.1 percent, having fallen 1.3 percent in the previous session to a 4-1/2 month low following the Chinese factory activity report, it said."}, "18": {"date_posted": "22/1/2014", "title": "Market Close: KLCI falls 0.1% on QE concerns, weaker ringgit ", "article": " KUALA LUMPUR (Jan 22): The FBM KLCI pared losses for a 0.1% or 1.24 point decline to1,814.10. The KLCI had fallen in anticipation of US policymakers further reducing quantitative easing (QE) measures next week, fund managers say. The QE essentially generates capital flows into Asian emerging markets, hence, demand for regional assets. As such, a QE reduction does not bode well for Asian equities on expectation of funds flowing back to US-based assets.\\u00a0  \"The KLCI has declined in anticipation of the US QE reduction,\" a fund manager told theedgemalaysia.com over telephone today. The US Federal Reserve officials will meet on January 28 and 29 to decide on the country's QE policy. Today's KLCI decline came on losses in stocks like CIMB Group Holdings Bhd and Axiata Group Bhd. The fund manager however said \"the KLCI may see a technical rebound at 1,800-points\". The KLCI had fallen to its current level from its record intraday high of 1,882.20 seen on December 31, 2013. It is worth noting that the ringgit weakened further today to 3.3280 versus a strengthening US dollar, Bloomberg data shows. This compares to 2.9570 on May 7, 2013. \\u00a0 Bursa Malaysia saw 1.84 billion shares worth RM2.14 billion changed hands. There were 325 gainers versus 464 decliners. The top gainer was British American Tobacco (M) Bhd while the leading decliner was Hong Leong Capital Bhd. The most-active stock was KNM Group Bhd. Across Asia, Japan's Nikkei rose 0.16% while Hong Kong's Hang Seng added 0.21%. Elsewhere, Singapore's Straits Times fell 0.02% Reuters reported that Asian share markets struggled for inspiration on Wednesday, hampered by expectations of further reductions in the Fed's stimulus and ahead of central bank meetings in Japan and Thailand. The dollar remained broadly supported, trading around its highest level since mid-November against a basket of currencies, with many investors expecting the Fed to trim its bond buying further next week. \"Investors started the year with an optimistic global economic outlook. But so far, we haven't seen much in the way of additional proofs for such optimism,\" said Daisuke Uno, chief strategist at Sumitomo Mitsui Bank."}, "19": {"date_posted": "16/1/2014", "title": "Noon Market: KLCI erases gains, falls 0.5% on profit taking", "article": " KUALA LUMPUR (Jan 16): The FBM KLCI erased earlier gains for a 9.3-point or 0.5% decline. Analysts said the Malaysian stock market could be ripe for profit-taking after recent gains which had raised local equities' valuations. At 12.30pm, the KLCI settled at 1,814.73. The decline came on losses in telecommunication stocks like Axiata Group Bhd and DiGi.Com Bhd. \"Profit-taking interest should increase to check rallies on lower liners and small caps given recent sharp gains, and amid fresh external volatility ahead of the long three-day weekend break,\" TA Securities Holdings Bhd wrote in a note today. Worth noting is a report by MIDF Amanah Investment Bank Bhd which indicates that the KLCI which has traded at a price-earning ratio above the regional average, may see its valuations curbed by several factors. MIDF analyst Syed Muhammed Kifni said these factors include foreign funds outflow due to the US quantitative easing tapering, and expectation of interest rate hikes in Malaysia. Anticipation of muted KLCI 2014 earnings growth of some 10% and Malaysia's \"relatively weak albeit improving current account situation\" may also curb the KLCI's valuation, he said. Across Bursa Malaysia, some 973 million shares worth RM957 million changed hands. There were 209 gainers versus 475 decliners. The top gainer was Hong Leong Capital Bhd. Bursa Malaysia has issued an unusual market activity (UMA) query on Hong Leong Capital, a financial services entity on the \"unusual rise\" in its share price in recent months. The leading decliner was Aeon Credit Services (M) Bhd while the most active stocks included Iris Corp Bhd and Sumatec Resources Bhd. Trading in Bursa Malaysia was closed last Tuesday (January 14) in conjuction with Prophet Muhammad's birthday. Tomorrow (January 17), trading will be closed again for Thaipusam. Today, major Asian stock markets rose. Japan's Nikkei climbed 0.3% while Hong Kong's Hang Seng added 0.29%. Reuters reported that the dollar rose to a one-week high against the yen on Thursday, as a set of robust U.S. data and upbeat earnings from Bank of America helped offset concerns of a U.S. slowdown following December's disappointing payroll numbers. Japan's Nikkei benchmark advanced 0.5 percent in relatively active trade after logging its best one-day rise in four months on Wednesday, a day after suffering its worst session in five months."}, "20": {"date_posted": "10/1/2014", "title": "Further profit taking may be likely", "article": " ASIAN share markets fell yesterday as Japanese shares slid from a 5\\u00bd year high. Regional bond risks rose as China\\u2019s inflation eased and producer prices extended declines, adding to the signs that the economy is weakening. The US dollar climbed before the jobs data was due last night.  Expectation that the initial jobless claims would fall caused the American markets to ease off on Wednesday night. The SP500 lost 0.27 points to close at 1,837.61 points whilst the Dow fell 68.2 points to end at 16,462.74. The FBM KLCI traded in a sideways range of 15.4 points for the week with volumes of 1.6 billion to 1.96 billion shares done. The index closed at 1,828.21 yesterday, down 3.09 points from the previous day as blue-chip stocks like IOI Corp Bhd, Sime Darby Bhd, Axiata Group Bhd, CIMB Bank Bhd and Tenaga Nasional Bhd caused the index to decline on profit taking activities yesterday. The index rose on a rally from the 801.27 low (October 2008) to the previous 1,826.22 all-time high (May 2013) and it represented an extended Elliott Wave \\u201cFlat\\u201d rebound in a \\u201cPseudo-Bull\\u201d rise completed. The index price movements in the next few months following May 2013 were trapped in a rangy consolidation with key swings of 1,723.74 (low), 1,811.65 (high), 1,660.39 (low), 1,805.15 (high), 1,759.66 (low) and 1,882.2 (high). The index\\u2019s daily signals are mixed. The CCI and MACD are negative while the DMI, Oscillator and Stochastic are positive. As such, the index\\u2019s obvious support levels are seen at the 1,780, 1,800 and 1,822 levels, whilst the resistance areas of 1,828, 1,849 and all-time high of 1,882 will witness some heavy profit-taking activities. Our upside targets of 1,898, 1,900 and 1,924 for the index in the medium term may be deferred for now. Its simple moving averages (MA) depict a double time frame (weekly and monthly) uptrend for now. Its daily chart has turned into a neutral position in January 2014. Due to its mixed signals, we believe investors may adopt a \\u201crange trading\\u201d philosophy as the KLCI remains at fairly lofty levels with bearish divergent signals. As such, profit-taking on index components as well as small to mid caps may persist into the next fortnight. Despite the lofty tone of the KLCI, we are recommending a chart \\u201cbuy\\u201d on MKH Bhd, which is a RM1.1 billion market cap company with a return on equity of 12% based on its 12-month trailing earnings. The stock made a new recent high of RM3.27 in tandem with the improving sentiment of the small and mid cap property stocks. It seems that the recent recurring theme from the property segment is the asset revaluation approach, where investors favour property companies with strategic landbank with development potential.  The firm rise in the stock price can be attributed to investors\\u2019 optimism on its strong earnings trend led by the plantation and property and construction division. For the fourth quarter of financial year 2013 ended Sept 30, MKH\\u2019s group revenue rose 21%. The rise was attributed to its plantation division\\u2019s higher sales of crude palm oil and palm kernel, as well as the property and construction division\\u2019s revenue from ongoing and new developments. Despite the better profitability, profit before tax was lower due to an inclusion of foreign exchange losses in the current quarter totalling RM63 million due to a weakening rupiah and ringgit against the US dollar. Maybank-IB does not have fundamental coverage on MKH. A check on Bloomberg consensus revealed that three brokers have coverage on the stock, with all having a \\u201cbuy\\u201d call on the stock.  The stock is currently trading at a reasonable historical price-earnings ratio of 10 times and a price-to-book value of 1.2 times. MKH\\u2019s indicated dividend yield is at 3.14%. Its chart trends on the daily, weekly and monthly timeframes are very strong indeed. Its share price made an obvious surge since its monthly Wave-2 low of 57 sen in October 2008. Since that 57 sen low, MKH surged to its recent January 2014 high of RM3.27.  Its chart has moved into very strong daily, weekly and monthly uptrends to the recent high of RM3.27. As it broke above its recent key critical resistances of RM2.62 and RM2.85, look to buy MKH on any dips to its support areas as the moving averages depict very firm short to long term uptrends for this stock.  The daily, weekly and monthly indicators (like the CCI, DMI, MACD and Oscillator) are very strong and now depict the obvious indications of MKH\\u2019s eventual surge to higher levels. We expect MKH to remain very firm towards its support levels of RM2.62, RM2.85 and RM3.10.  It will attract minor profit taking at the resistance levels of RM3.27, RM3.58 and RM4.13. Its upside targets are now located at RM3.45, RM3.76, RM4.09 and RM4.22. This article first appeared in The Edge Financial Daily, on January 10, 2014."}, "21": {"date_posted": "6/1/2014", "title": "Telecom players trading on catalysts", "article": " Telecommunications sectorMaintain neutral: We remain \\u201cneutral\\u201d on the telecommunications sector and see little scope for substantial share price appreciation given the sector\\u2019s still lofty valuations at 10 times 2014 enterprise value/earning before interest, tax, depreciation and amortisation (EV/Ebitda) vis-a-vis 4.5% Ebitda growth, and the likely rise in bond yields. Nevertheless, downside is likely limited, a consequence of the trapped domestic liquidity. We see pockets of trading opportunity given the potential crystallisation of stock-specific catalysts in 2014. The possibility of a price war heading into 2014 cannot be entirely dismissed, particularly after the management restructuring at Maxis Bhd. Nevertheless, the new chief executive officer\\u2019s statement that Maxis will not compete on pricing was a welcome relief. We thus expect competition among the cellular majors to remain rational in the next 12 months. This will allow the companies to continue to focus on further monetising data. The growth in data usage is both explosive and secular, driven by: (i) increased users; (ii) faster Internet access; and (iii) improved content. For fixed-line players, we continue to expect growth in data revenue to more than offset falling voice revenue. With Maxis re-evaluating its integrated model, the competitive intensity in the fibre broadband segment could potentially decline. Within the next 12 months, DiGi.Com Bhd will announce its decision on whether to pursue a business trust (to overcome its dividend payout constraints). Telekom Malaysia Bhd (TM) could potentially receive a government grant for the rollout of Phase 2 of its high speed broadband service, while Axiata Group Bhd is working on a potentially value creating tower spin-off. In the longer term, Time dotCom Bhd (TDC) could once again unload its remaining DiGi shares. Maxis meanwhile could demonstrate signs of a turnaround. Our only \\u201cbuy\\u201d in the sector is TDC (target price [TP]: RM4.40), as it is most exposed to the secular growth trends of data, and has capital management potential. Among the big caps, our relative preference is TM (\\u201chold\\u201d, TP: RM5.50) and DiGi (\\u201chold\\u201d, TP: RM4.95) given their underperformance in 2013 and the emergence of potential rerating catalysts in the near term. \\u2014 Maybank IB Research, Jan 3 This article first appeared in The Edge Financial Daily, on January\\u00a006, 2014."}}