{"0": {"date_posted": "30/11/2016", "title": "KLCI to trade range bound, ringgit weakness to weigh sentiment", "article": " KUALA LUMPUR (Nov 30): The FBM KLCI is expected to trade range bound today, despite the uptrend at most global markets as sentiment at the local bourse remains wary. Sentiment at the local market is also heavily weighed by the volatility of the ringgit versus the U.S. dollar in recent weeks. Meanwhile, Forex Time Vice President of Corporate Development and Market Research, Jameel Ahmad said he projects the ringgit to be at around RM4.40 to RM4.50, adding that the ringgit currency may go lower to about RM4.60 at the end of this year, due to the \\u201cdollar domination\\u201d. He also noted that a firmer outlook of the ringgit currency can only be determined once Donald Trump is inaugurated on Jan 20, 2017. \\u201cThe US dollar has moved to levels not seen in over 12 years,\\u201d said Jameel, adding that the Dollar index is trading above 100. Stock prices around the world rose on Tuesday following upbeat U.S. growth data and strength in U.S. healthcare shares, while oil prices tumbled to the weakest level in over a week on doubts OPEC could reach an accord to reduce output, according to Reuters. The dollar fell against a basket of currencies on profit-taking. The dollar index had hit a near 14-year peak last week on expectations a Trump administration would result in tax cuts and a surge in federal spending to bolster the U.S. economy, it said. Based on corporate announcements and news flow yesterday, companies that may be in focus today could include: Melewar Industrial Group Bhd, Ahmad Zaki Resources Bhd, Alliance Financial Group Bhd, Panasonic Manufacturing Malaysia Bhd, Lafarge Malaysia Bhd, Lingkaran Trans Kota Holdings Bhd, Kimlun Corp Bhd, DRB-Hicom Bhd, PBA Holdings Bhd, My EG Services Bhd, Karex Bhd, Mudajaya Group Bhd, Power Root Bhd, Dutch Lady Milk Industries Bhd, Benalec Holdings Bhd, Media Prima Bhd, Allianz Malaysia Bhd, and Sime Darby Property Bhd."}, "1": {"date_posted": "9/10/2014", "title": "Kulim intends to accept Sime Darby's NBPOL buy ", "article": " KUALA LUMPUR (Oct 9): Kulim (M) Bhd intends to accept the offer by Sime Darby Bhd\\u2019s plantation unit, Sime Plantation Sdn Bhd, to acquire its 49% stake in Papua New Guinea-based (PNG) New Britain Palm Oil Ltd (NBPOL). In a filing with Bursa Malaysia this evening, Kulim said its acceptance is subject to \"there being no superior offer\" and its shareholders\\u2019 approval. If accepted, Kulim will be disposing its entire stake in NBPOL, comprising 73.4 million shares, at an offer price of \\u00a37.15 per share for \\u00a3525.40 million or RM2.75 billion. It added that it update shareholders on its intentions once it has received the formal offer from Sime Darby Plantation. The announcement also came attached with a copy of NBPOL\\u2019s statement, dated the same day, where NBPOL chairman\\u00a0Antonio Monteiro de Castro said the offer will provide an opportunity for all shareholders to realise their investment in NBPOL at an attractive valuation. \"We also believe it represents a positive outcome for our employees, our customers and other stakeholders.\\u00a0By joining the Sime Darby Group (following the successful completion of\\u00a0the offer), NBPOL will benefit from having a strong, supportive partner to drive future expansion and growth\\u00a0in PNG and internationally,\" he said in statement. At a briefing earlier today, Sime Darby president and group CEO Tan Sri Mohd Bakke Salleh said the group's offer price was fair, despite its 85% premium to NBPOL's last closing price, as Sime Darby felt its share price did not \"reflect the underlying value of its business\". \"It is not often that an opportunity such as this presents itself. The strategic fit between NBPOL and Sime Darby Plantation is the key factor that will ensure the success of this deal,\" he said. Mohd Bakke also said Sime Darby Plantation intends to delist NBPOL from the London Stock Exchange and to keep the listing on PNG's Port Moresby Stock Exchange, and re-listing it later on either Bursa Malaysia or the Singapore Stock Exchange. In a note today, AmResearch said it views the\\u00a0proposed acquisition\\u00a0negatively as \"the\\u00a0valuation is at the upper range and would be value dilutive to the group\". \"Sime Darby\\u2019s cash offer of GBP7.15/share\\u00a0for a total of RM5.6bil values the latter at 22x PE FY15F earnings based on Bloomberg estimates.\\u00a0Sime Darby itself is currently trading at only 14x FY15F earnings,\" said AmResearch."}, "2": {"date_posted": "18/6/2014", "title": "Sime Darby bags seven awards at MIRA 2014", "article": " KUALA LUMPUR: Sime Darby Bhd walked away with the most awards at the Fourth Malaysian Investor Relations Awards 2014 (MIRA 2014) yesterday, with seven awards including Best Company for investor relations (IR) in the large cap category, Best Business Knowledge and Insights of an IR Team, Best Quality of Annual Report and Formal Disclosure, and Best IR Website (large cap). Sime Darby president and group chief executive Tan Sri Mohd Bakke Salleh\\u00a0was named Best CEO for IR in the large cap category, while its vice-president of investor relations Benjamin Poh Chee Fong and its group chief financial officer Datuk Tong Poh Keow took home the Best IR Professional (large cap) and Best CFO for IR (large cap) awards respectively. Genting Plantations Bhd bagged three awards including Best Quality One-One-One Meetings and Best Company for IR in the mid cap category. Its senior manager of corporate Benjamin Low Ewe Ee was named Best IR Professional\\u00a0in the mid cap category. Other winners at the annual event, which was organised by the Malaysian Investor Relations Associations (MIRA), included AirAsia X Bhd for Best IR for an IPO in 2013, Felda Global Ventures Holdings Bhd for Most Improved Services from IR Team and AirAsia Bhd for Best IR Website in the mid cap category and MKH Bhd\\u00a0for Best Company for IR in the small cap category. The IR Awards recognises exemplary best practices in IR among public-listed companies and their management in Malaysia. In benchmarking and recognising best practices of IR professionals and public-listed companies listed on Bursa Malaysia, MIRA had engaged Nasdaq OMX to commission the Malaysia IR Survey of the Buy-Side and Sell-Side who invest in and cover Malaysian equities to participate in the survey which was conducted between March 19 and May 23. A total of 10 categories surveyed by Nasdaq OMX was polled under the large, mid and small market cap referenced against the basket of companies under the FTSE Bursa Malaysia Index Series during the period. \\u201cIt is undeniable that the best practices of investor relations can ultimately contribute to a company\\u2019s shares achieving fair valuation,\\u201d said Bursa Malaysia Bhd chief executive officer Datuk Tajuddin Atan at the award presentation yesterday. He added that IR is a strategic management responsibility which straddles and integrates the areas of finance, communications and public relations, marketing and regulatory compliance. \\u201cStrategic IR is all about providing market access to relevant company information and clear channels of communications to the investment community,\\u201d said MIRA chairman Steven Tan.  \\u201cAs an IR professional myself, I don\\u2019t believe that it is purely about maximising valuations. It is more about education and ensuring that a company stock is fairly valued through the fair dissemination of information,\\u201d he said. The Edge weekly is the exclusive media partner for this year\\u2019s event. Tajuddin (left) presenting the award for the Best CEO for IR in the large cap category to Sime Darby\\u2019s Mohd Bakke at MIRA 2014 at Sime Darby Convention Centre yesterday.  This article first appeared in The Edge Financial Daily, on June 18, 2014."}, "3": {"date_posted": "6/6/2014", "title": "E&O\\u2019s STP2 expected to be endorsed this month", "article": " Eastern & Oriental Bhd(June 5, RM2.75)Maintain buy with target price of RM3.90: Following a recent luncheon meeting with management, we reaffirm our \\u201cbuy\\u201d rating on E&O with an unchanged fair value of RM3.90 per share \\u2014 a 15% discount to our net asset value (NAV) of RM4.61 per share, which includes our assumed land value of RM250 per sq ft (psf) for Phase 2 of the company\\u2019s Seri Tanjung Pinang (STP2) project. We have yet to impute development profits into our NAV model. We see a more balanced shareholding structure after E&O managing director Datuk Terry Tham increased his stake in the company. Tham had recently announced that he would be acquiring a 10% stake from Sime Darby Bhd for RM2.90 per share, raising his stake to 15%. Sime Darby\\u2019s stake will be reduced to 22% after the disposal.  Tham\\u2019s higher stake in E&O should demonstrate the management\\u2019s commitment to ensuring a smooth execution of STP2. The move will also promote greater alignment of interests between management and shareholders. Management reaffirms that STP2\\u2019s master plan is expected to be endorsed by the Penang government this month. E&O is currently exploring funding options for the reclamation of land for STP2.  Management also alluded that there is little need for equity fund raising given E&O\\u2019s strong balance sheet \\u2014 net gearing of 30% as at financial year 2014 ended March 31 (FY14) \\u2014 and the strong development potential of STP2. Land was recently transacted at RM600 to RM700 psf in the Tanjung Tokong area in Penang where STP2 will be developed. What is more important now is the establishment of a benchmark land price for STP2. At the moment, there is a range of imputed land values for STP2 in the market. In our NAV model, we have assumed RM250 psf for STP2. We believe that E&O may carve out select parcels for commercial developments, which will be sold to reputable global/regional developers once it commences reclamation works for STP2. Such a move will not only set a precedent in pricing land values in STP2 but also trigger significant NAV upgrades, we believe. This is a crucial share price driver. Meanwhile, E&O is looking to step up prices for the remaining 250 terraced units at Avira in Iskandar Malaysia, Johor. Phase 1 of the project (208 units) achieved a 70% take-up at RM605 psf during a special preview. Demand for Avira is expected to remain strong. There is also interest among Singapore buyers given the project\\u2019s strategic advantage as the first landed development within Medini in Iskandar Malaysia. The 20 residential units in E&O\\u2019s Princess House in London are fully sold. The company is still in negotiations for an en bloc sale of 34 serviced apartment units in the property. The stock is currently trading at a steep 41% discount to its NAV of RM4.61 per share. \\u2014 AmResearch, June 5 This article first appeared in The Edge Financial Daily, on June 6, 2014."}, "4": {"date_posted": "29/5/2014", "title": "Market Close: KLCI rises 0.26%, select blue chips lift", "article": " KUALA LUMPUR (May 29): The FBM KLCI rose 0.26% on Thursday, lifted by gains at select blue chips and in line with most global markets that flirted with all-time peaks. The benchmark index closed 4.96 points to 1,867.62, lifted by gains including at Maybank, Public Bank and Petronas Dagangan. Leading stocks on Thursday include Allianz, Petronas Dagangan, Tahps, Quality Concrete, Dana Infra, Apollo, Uzma and Press Metal. Etitech was the most actively traded counter with 55.88 million shares done. The stock added one sen to 10.5 sen. The other actives included Sumatec, Olympia, ASB, KNM, AirAsia X, Land & General, Iris Corp and Public Bank. The decliners included Petronas Gas, Nestle, Dutch Lady, Shangri-La, Prestariang, Country View, Carlsberg, Axis REIT and Century Logistics. Among the major companies to announce their quarterly results on Thursday were Malayan Banking Bhd and Sime Darby Bhd. Following the announcements, Maybank rose four sen to RM9.98 while Sime Darby slipped five sen to RM9.50. Affin IB Vice President and Head of Retail Research Dr Nazri Khan says he expects local market to brace for a rebound, benefitting from favourable external factors and the mega listing of two local IPOs (Seven Eleven and Boustead Plantation). \\u201cAs the external markets turned more risk-friendly, we note that ringgit hovered onto the strong foot. \\u201cThe local currency was up 4.5% per cent against the dollar since February 2014, leaving it on track for its strongest finish in more than six months. \"On the technical front, the FBM KLCI close above the 20-day and 50-day moving averages indicates the trend are still turning up,\\u201d he said. Nazri, who is also president of the Malaysian Association of Technical Analysts, said the next downside objective was the 1,870 and 1.850 support levels. He said the next area of upside was near the 1,890 all time high and ultimately the 1,900 strong psychological resistance. On market breadth, there is a slight negative distribution with weekly decliners beating advancers by a moderate 4 to 3 on a slightly heavier average daily trade of 2 billion shares worth RM2.1 billion, he said. Aggressive bulls might consider buying FBMKLCI futures, riding on trendline breaks above 1880 while using 1850 as a cut-loss-price. Stock-wise, traders should accumulate World Cup linked blue chip stocks which do well as the event approaches. Elsewhere, global shares flirted with an all-time peak on Thursday while the euro touched its weakest in more than two months on bets the European Central Bank would unveil new stimulus measures next week, according to Reuters. ECB policymakers have opened the door to a rate cut, effectively charging banks to hold cash at the central bank overnight, and to a refinancing operation aimed at supporting businesses when its board meets on June 5, it said."}, "5": {"date_posted": "29/5/2014", "title": "Hot Stock: E&O jumps 8% on stake sale to MD, stock seen undervalued", "article": " KUALA LUMPUR (May 29): Eastern & Oriental Bhd (E&O) jumped as much as 19 sen or 8% following announcement that Sime Darby Bhd is selling a 9.9% stake in E&O to E&O managing director Datuk Terry Tham. At 10:30am, property developer E&O rose to a high of RM2.57 before giving up some gains to trade at RM2.51 with some 4.4 million shares done. Sime Darby Nominees Sdn Bhd, a unit of Sime Darby has entered into a share sale agreement with Tham\\u2019s private vehicle Morning Crest Sdn Bhd. This is for the sale of 110 million shares or 9.9% in E&O to Tham for RM319 million. The offer of RM2.90 per share is at a premium of 21.8% from the E&O shares'\\u00a0 closing price of RM2.38 yesterday. The sale will see Sime Darby's equity interest reduced to 22% in E&O. RHB Research Institute Sdn Bhd analyst Loong Kok Wen wrote in a note:\\u201cWhile this means a greater alignment of management\\u2019s interest, the transacted price of RM2.90 may now be viewed as a new base price for any future takeover offers.\\u201d Loong retained RHB's \\u201cbuy\\u201d call on E&O shares with an unchanged fair value of RM3.12. MIDF Amanah Investment Bank Bhd analyst Kelly Tan told theedgemalaysia.com over telephone: \\u201cThe news is positive as we can see the stock price is already rallying this morning.\\u201d  Asked whether this meant a revision to E&O's share price, Kelly said there would not be a revision but she reaffirmed MIDF's \\u201cbuy\\u201d rating on the stock. \\u201cWe see growth in earnings coming in its FY2015,\\u201d said Kelly. Based on an earlier report by MIDF, the firm had placed a \\u201cbuy\\u201d rating on the stock with a target price (TP) of RM2.67. Meanwhile, AmResearch Sdn Bhd analyst Tan Ee Zhio said the firm believed the development in E&O was good. \\u201cThis new deal with E&O is a good one in conjunction with the development of Seri Tanjung Pinang 2 (STP 2),\" the analyst said. In a report today, Ee Zhio maintained AmResearch's \\u201cbuy\\u201d call on E&O shares with an unchanged TP of RM3.90. \\u201cWe remain committed to our investment thesis on STP 2 given the significant net asset value (NAV) expansion to RM4.61 per share from RM1.36 per share. The stock is trading at a steep 48% discount to its NAV,\\u201d said Ee Zhio."}, "6": {"date_posted": "29/5/2014", "title": "Highlight: Sime Darby sells E&O shares back to Tham", "article": " KUALA LUMPUR: While the memory of Sime Darby Bhd paying a hefty premium for a 30% stake in Eastern & Oriental Bhd (E&O) is still fresh in investors\\u2019 minds, the conglomerate yesterday announced that it intends to sell a 9.9% stake back to E&O managing director Datuk Terry Tham Ka Hon at RM2.90 per share \\u2014 which is 26% higher than the price it paid three years ago.  Sime Darby explained that the proposed disposal would \\u201cfurther align the interests of Tham and key senior personnel with that of E&O\\u201d.  It is learnt that the share sale aims to retain senior management to continue managing and charting E&O\\u2019s strategy over the years, said sources, adding that this move was taken to prevent the property firm from falling into the same situation S P Setia Bhd is in now.  Many senior executives in S P Setia, including Tan Sri Liew Kee Sin, left the company following Permodalan Nasional Bhd\\u2019s (PNB) acquisition of a 48.76% stake in the property group. Liew, who helmed the group for years, left after he sold his entire stake to PNB.  Tham was among three parties who had collectively sold a 30% equity interest in E&O to Sime Darby for RM766 million. Tham sold a 12.2% stake then. The other two were Tan Sri Wan Azmi Wan Hamzah and Singapore-based GK Goh Holdings Ltd.  Following the disposal, Tham was left with a 5.1% stake in E&O, Wan Azmi 2.9% and GK Goh 3.5% in E&O. GK Goh has raised its stake to 7.25% later.  In a filing with Bursa Malaysia yesterday, Sime Darby said its wholly-owned subsidiary, Sime Darby Nominees Sdn Bhd (SDN), has entered into a conditional share sale agreement with Tham\\u2019s private vehicle, Morning Crest Sdn Bhd, to sell 110 million or a 9.9% stake in E&O for RM319 million. Following the proposed disposal, Sime Darby\\u2019s equity interest in E&O will be pared down to 22%.  It noted that the total cash consideration of RM319 million or RM2.90 per share that it is offering to Morning Crest was RM56 million higher than Sime Darby\\u2019s average cost of investment of RM250 million. In other words, the conglomerate could make a return on investment of 28%. The offer of RM2.90 per share is at a premium of 21.8% from yesterday\\u2019s closing price of RM2.38. After having considered all aspects of the proposed disposal, Sime Darby is of the view that the deal is \\u201creasonable\\u201d taking into consideration the premium over the prevailing market stock price of E&O. Sime Darby said the sale securities were acquired between 2011 and 2013 and the carrying amount of the sale securities as at June 30, 2013 was about RM263 million, which is worth RM2.39 per E&O share. The pricing of the shares at RM2.30 each, which was a huge 59% premium to the E&O share price at that time, had raised eyebrows The share sales had sparked debate whether it was tantamount to a related party transaction and whether Sime Darby should undertake a mandatory general offer for E&O.  However, the Securities Commission Malaysia (SC) ruled that it found no collusion between Sime Darby and E&O\\u2019s Tham with regard to the deal. \\u201cIt is the SC\\u2019s findings that Sime Darby and Datuk Terry Tham Ka Hon are not parties acting in concert, and as such, a mandatory offer obligation would not arise,\\u201d Sime Darby told Bursa in an announcement dated Oct 11, 2011. This article first appeared in The Edge Financial Daily, on May 29, 2014."}, "7": {"date_posted": "27/5/2014", "title": "Market Open: Flat start for KLCI, gains seen limited", "article": " KUALA LUMPUR (May 27): The FBM KLCI started Tuesday on a flat note and edged up marginally in early trade, despite the firmer opening at most regional markets.  At 9.02am, the FBM KLCI added 0.65points to 1,863.45. Gainers led losers by 87 to 76, while 119 counters traded unchanged. Volume was 51.74 million shares valued at RM17.24 million. The top gainers included United Plantations, BAT, Golden Pharos, Petronas Gas, LTKM, Coastal Contracts, Lay Horng, Lii Hen and Datasonic. BIMB Securities Research in a market preview Tuesday said Asian share market advanced on Monday following a record high on the S&P 500 on Friday and amid speculation Chinese policy makers will take further steps to bolster economic growth. It said the MSCI Asia Pacific Index added 0.4% to 141.54. The research house said investment rationale for risker assets underpinned across the Asian market on gaining confidence over US economy after better-than-expected April home sales report saw U.S. stocks gain for a third day on Friday, with the S&P 500 closing above 1,900 points for the first time ever. BIMB Securities Research said regional market received further support from remarks by Chinese Premier Li Keqiang that suggested Beijing was preparing further mini-stimulus measures to support the economy. \\u201cHowever, on the local front, the FBM KLCI was down 6.42 points or 0.34% to 1,862.80, dragged down by Maxis, Sime Darby and plantation heavyweight IOI Corp. \\u201cWeakening crude palm oil prices also impacted plantations and third-month delivery fell RM24 to RM2,493. \\u201cExpect market to move sideways with immediate resistance at 1,875.3 and immediate support at 1,863.1,\\u201d it said. Elsewhere, Asian stocks got off to a firm start on Tuesday, and the euro steadied but remained vulnerable after overnight comments from the European Central Bank chief heightened expectations of easing steps in the euro zone, according to Reuters. MSCI's broadest index of Asia-Pacific shares outside Japan rose about 0.2 percent, while Japan's Nikkei stock average added 0.8 percent in early trade, after it ended at a 7-week high on Monday, it said."}, "8": {"date_posted": "5/5/2014", "title": "Minority shareholder of E & O drops appeal in Sime Darby case ", "article": " KUALA LUMPUR: Michael Chow Keat Thye, a minority shareholder of Eastern & Oriental\\u00a0Bhd (E&O), who had sought legal action over Sime Darby Bhd\\u2019s acquisition of a 30% stake in E&O from three major shareholders for RM776 million or RM2.30 per share \\u2014 a 60% premium to the stock price at the time of announcement back in August 2011, has dropped his appeal as the share price has now exceeded RM2.30. This ends 2\\u00bd-year tussle with the conglomerate. Chow had sought to overturn a decision of the High Court made on Nov 14 2013 to strike out his application for a judicial review against the Securities Commission\\u2019s (SC) 2011 decision not to compel Sime Darby to make a general offer for the remaining shares in E&O. The High Court had then awarded costs of RM10,000 to the SC. In a filing with Bursa Malaysia last Friday, Sime Darby said the lawyers of Chow had on April 21 written to the lawyers of Sime Darby Nominees Sdn Bhd seeking the latter\\u2019s consent to the withdrawal of the appeal to the Court of Appeal. This was made \\u201con the grounds that given the price per share has now exceeded RM2.30 (being the price of the purported mandatory take-over offer contended by Chow), the continuation of the judicial review proceedings would be an academic exercise\\u201d, said Sime Darby. \\u201cWith this development, Sime Darby Nominees has been advised by its\\u00a0lawyers that the judicial review proceedings have now come to an end,\\u201d it added. Shares in E&O closed up three sen or 1.27% to RM2.40 on Friday, giving it a market capitalisation of RM2.65 billion. In August 2011, Sime Darby had purchased a 30% stake from E&O managing director Datuk Terry Tham Ka Hon, GK Goh Holdings Ltd and Tan Sri Wan Azmi Wan Hamzah. Chow reportedly saw red when the SC waived Sime Darby\\u2019s obligation to then extend the offer to the remaining shareholders in the company. In December 2011, he filed an application for a judicial review against the SC\\u2019s decision with the High Court, reportedly seeking a judgement that would overturn the SC\\u2019s decision for a waiver and compel Sime Darby to make an offer for shares in E&O it does not own. Chow had named the SC as his respondent. Sime Darby, however, through Sime Darby Nominees, filed an application to intervene in the proceedings given that its legal and commercial interest would be directly affected by it. Its application was allowed. The lawsuit by Chow has been watched with much interest as it displayed minority shareholder activism in corporate Malaysia. This article first appeared in The Edge Financial Daily, on May 5, 2014."}, "9": {"date_posted": "30/4/2014", "title": "Noon Market: KLCI rises 0.43%, select blue chips lift", "article": " KUALA LUMPUR (April 30): The FBM KLCI rose 0.43% at the midday break on Wednesday, lifted by select blue chips as sentiment held firm ahead of the US Federal Reserve meeting outcome and release of economic data. At 12.30pm, the FBM KLCI added 8.11 points to 1,867.45. Gainers led losers by 333 to 329, while 301 counters traded unchanged. Volume was 784.52 million shares valued at RM873.19 million. The top gainers include Panasonic, BAT, Petronas Dagangan, KLK, Takaful, Sime Darby, Melati, Encorp, Hong Leong Industries and Bonia. The actives include Utopia, China Stationery, Xinghe, Visdynamics, Asiapac, PDZ and AirAsia. The top losers include Dana Infra, Cahya Mata Sarawak, Golsta, Carlsberg, Deleum, Eco World, Warisan, Advanced Packaging and Southern Acids. Affin IB Vice President and Head of Retail Research Dr Nazri Khan said that going forward, he expected firmer market action after the local stock market advanced for the third straight month on relatively good volume (gaining a total of 96 points or 5.4% since 4th February 2014). He said the FBM KLCI should resume its upward path as bulls took heart from reduced Ukraine tension, lower prospects for a shift in Fed's tapering bias, a recovering USA economy (positive report on USA retail sales registering the largest gain in 18 months), rising commodity prices and more liquidity boost from the Bank of China and European Central Bank \\u201cOn the technical front, despite Friday weakness, the FBM KLCI has scored its sixth successive daily rise, the longest run of daily gains since 1st March 2014. \\u201cAs for strategy, traders should look towards the start of a new upleg and aggressively position for momentum market leaders namely construction (ETP Play), properties (ETP Play) and technology stocks (USA Recovery Play) which include our Top Ten Picks i.e. Matrix, Ecoworld, MKLand, Bertam, IJM, Muhibah, Mitra, Willow, Gtronic and Granflo. \\u201cAggressive traders might also consider capitalising on upside volatility by purchasing global index futures or accumulating medium term USA index call options,\\u201d he said. Elsewhere, Asian shares firmed on Wednesday after earnings-fuelled gains on Wall Street, while the euro remained under pressure after weaker-than-expected German inflation data raised speculation of more easing in Europe, according to Reuters. Investors stayed cautious before central bank decisions from the Bank of Japan and then the Federal Reserve later in the session, as well as key U.S. jobs data on Friday, it said."}, "10": {"date_posted": "21/4/2014", "title": "Market Open: KLCI starts week on subdued note, select blue chips weigh", "article": " KUALA LUMPUR (April 21): The FBM KLCI got off to a subdued start to the week in early trade on Monday, weighed by losses at select blue chips including Petronas Chemicals, Tenaga, Sime and Public Bank. At 9.05am, the benchmark index fell 2.80 points to 1,849.89. Gainers led losers by 191 to 56, while 176 counters traded unchanged. Volume was 136.34 million shares valued at RM55.19 million. The top losers in early trade included Hong Leong Capital, Petronas Chemicals, Titijaya, F&N, Malpac, Tenaga, FPI, Sime Darby, IHH and Public Bank. Hong Leong IB Research in a market preview Monday said that unless the FBM KLCI stages a decisive breakouts above 1,860 (10 Apr high) and 1,870 (4 Apr high) levels, the index could still extend its sideways consolidation in the near term, with key supports at 1,831-1,839. \\u201cCurrent two-tier market is expected to persist, with blue chips stuck in consolidation amid inactive institutional buying, while lower liners and small cap stocks will continue to attract retail participation on rotational trading interest,\\u201d it said. Elsewhere, Asian stock markets started the week on a subdued note on Monday, as tensions in Ukraine kept investors cautious amid the absence of catalysts as several markets remained closed for Easter holiday, according to Reuters. MSCI's broadest index of Asia-Pacific shares outside Japan inched down 0.1 percent, it said."}, "11": {"date_posted": "15/4/2014", "title": "CapitaLand to take CapitaMalls Asia private for S$3.06b", "article": " KUALA LUMPUR: Singapore-based CapitaLand Ltd has proposed to take its 65.3%-owned subsidiary CapitaMalls Asia Ltd (CMA) private via a voluntary conditional cash offer of about S$3.06 billion (RM7.9 billion) for the remaining ordinary shares in the latter. CMA is linked to CapitaMalls Malaysia Trust (CMMT), a Malaysia-based real estate investment trust (REIT) that has four shopping malls in the country \\u2014 Gurney Plaza in Penang, Sungei Wang Plaza in Kuala Lumpur, The Mines in Selangor and the East Coast Mall in Kuantan, Pahang \\u2014 in its portfolio. CMA, one of Asia\\u2019s leading shopping mall developers, owners and managers, is partnering Sime Darby Property Bhd in a 50:50 joint venture to develop a shopping mall in Taman Melawati, Kuala Lumpur. In an announcement to the Singapore Exchange (SGX) yesterday, CapitaLand said its wholly-owned subsidiary, Sound Investment Holdings Pte Ltd, will make a voluntary conditional cash offer with a view to delist CMA, which is listed on the SGX and the Hong Kong stock exchange. The offer is conditional upon Sound Investment receiving acceptances that will result in the company and parties acting in concert holding more than 90% of CMA shares. The earliest closing date for the offer is end-May or June. As at Feb 21, the other substantial shareholders of CMA are Citibank Nominees Singapore Pte Ltd (7.05%), DBS Nominees Pte Ltd (6.93%), DBSN Services Pte Ltd (6.29%) and HSBC (Singapore) Nominees Pte Ltd (3.05%). CapitaLand said its S$2.22 per share offer represents a 27% premium to CMA\\u2019s volume weighted average price for the last one month and a 20.7% premium to the net asset value per share as at Dec 31, 2013. It plans to fund the share acquisition through a combination of internal cash resources and borrowings of the CapitaLand group, excluding those of the CMA group. CapitaLand, 39%-owned by Temasek Holdings, said the proposed privatisation of CMA will significantly enhance its competitive strengths in integrated developments, simplify its organisational structure and unlock shareholder value.  CMA currently has S$26.7 billion of assets under management across Asia. A Reuters report said the company manages 105 shopping malls and earned 43% and 32% of its revenue from China and Singapore respectively last year. Most of the remaining revenue comes from Japan and Malaysia. CMA recorded a profit after tax and minority interest of S$600 million for FY13 ended Dec 31, 9.9% higher than the S$546 million recorded in FY12.  Its Malaysian portfolio has a total net lettable area of more than 2.5 million sq ft and valued at about RM3.1 billion. As at Dec 31, 2013, CMMT had a market capitalisation of about RM2.5 billion. CMA is linked to CapitaMalls Malaysia Trust, a Malaysia-based real estate investment trust that has four shopping malls in the country, including Gurney Plaza in Penang. This article first appeared in The Edge Financial Daily, on April 15, 2014."}, "12": {"date_posted": "3/4/2014", "title": "Stocks To Watch: Sime, Tenaga, Mitrajaya, Ingenuity, TRC Synergy, tourism-linked stocks, AFG", "article": " KUALA LUMPUR (April 3): Based on news flow and corporate announcements today, the following companies may be in focus tomorrow: Sime Darby Bhd will attract attention after South Africa's Competition Commission said today it raided the local offices of food manufacturers Unilever and Malaysia's Sime Darby as part of a probe into collusion. The commission conducted the \"search and seizure operation\" as part of an investigation into collusion in the manufacture and supply of edible oil and margarine, AFP reported. \"The Commission has reasonable grounds to believe that information relevant to this investigation is in the possession of employees of the two companies,\" it added, referring to Anglo-Dutch Unilever and Malaysia-based Sime Darby. Tenaga Nasional Bhd (TNB), which had fallen by as much as 4% to a low of RM11.26 today after Morgan Stanley downgraded the national utility to \"underweight\" and cut its earnings per share (EPS) forecast by 10%, may continue to be in focus. In its research note, Morgan Stanley said there was uncertainty over TNB\\u2019s sustained reform implementation with rising risk of adverse fuel mix and cost inflation. The research house said reform and cost control upside had already been priced in after a 48% outperformance in TNB\\u2019s share price. The firm's target price (TP) for TNB is RM12.20. Tenaga, the second largest loser today, closed at RM11.30, down 44 sen or 3.75%, on heavy trades. Mitrajaya Holdings Bhd announced today that its unit Pembinaan Mitrajaya Sdn Bhd has been awarded a construction contract worth RM277 million. The company said that it had on 2 April 2014 accepted from Symphony Hills Sdn Bhd, a member of the UEM Sunrise Group, the award for the proposed construction of the Main Building Works of\\u00a0 Housing Block 5 at Symphony Hills, Cyberjaya, for RM277.42 million. \\u201cThe contract is expected to contribute positively to MHB Group\\u2019s future earnings,\\u201d said the statement. The duration of construction is 29 months and the job is expected to be completed by August 2016.  The contract is expected to contribute positively to MHB Group\\u2019s future earnings, said the company. Ingenuity Consolidated Bhd said it was not aware of any reason for the unusual market activity (UMA) in relation to the high volume of trades in its securities. Bursa Malaysia had earlier slapped the firm with a UMA query, after the stock topped others in trades for the past trading days. The ICT service provider said it was not aware of any corporate development or rumour that may account for the UMA. At market close, the stock lost one sen to 8.5 sen on heavy trades of some 199 million shares. It was the most active stock today. TRC Synergy Bhd has secured two KL prime land real estate contracts with a collective value of RM414.6 million from SP Setia Group Bhd's unit KL Eco City Sdn Bhd. TRC said the contracts formed a portion of a mixed development within Kampung Haji Abdullah Hukum along Jalan Bangsar. TRC said the first contract valued at RM222.3 million involved construction of diaphragm walls, basement and podium, besides earth work, and piling. The project, starting April 7, 2014, is scheduled for completion by March 6, 2017. The second contract, valued at RM192.3 million, is expected to start on January 7, 2016 and completed by October 6, 2017. Tourism and aviation related stocks may come under focus again for the wrong reason after the MH370 incident: two foreign women were kidnapped from a resort off the coast of Semporna, Sabah, last night. The two are a 29-year-old Chinese national and a 40-year-old Filipino resort worker. Following the kidnappings, security forces have been placed on full alert along its sea border with southern Philippines. There were 60 tourists from China at the resort at the time of the incident. One of the tourists at the resort, a newspaper journalist from China, reported that many of the holidaymakers were in their rooms at various parts of the resort when the incident occurred. Alliance Financial Group Berhad (AFG) announced that its indirect 100%-owned Alliance Investment Bank Berhad has entered into a conditional share sale and purchase agreement with Hwang-DBS (Malaysia) Berhad today to buy the latter\\u2019s 51% equity interest in HwangDBS Vickers Research for RM393,945. DBS Vickers Securities Holdings Pte Ltd (DBS Vickers) is the remaining 49% shareholder in HDBSV. The acquisition will enhance the Alliance\\u2019s equity research capabilities and its institutional broking business by leveraging on DBS Vickers\\u2019 network of overseas clients to further expand the group\\u2019s investment banking business, especially the stock broking institutional business, said AFG."}, "13": {"date_posted": "2/4/2014", "title": "Highlight: B.Auto, CMSB, Oldtown, Sime are among 'stars of Invest ASEAN'", "article": " KUALA LUMPUR (Apr 2): Berjaya Auto Bhd, Cahya Mata Sarawak Bhd, Oldtown Bhd, Sime Darby Bhd, Top Glove Corporation Bhd and Wesport Holdings Bhd are among the nine companies listed as \\u201cstars of Invest ASEAN 2014\\u201d by Maybank KimEng. All these companies enjoy a \\u201cbuy\\u201d rating from the prominent regional research house. The other three companies in the list released today are BIMB Holdings Bhd, Felda Global Ventures Bhd and Malayan Banking Bhd. Berjaya Auto Bhd, with target price of RM2.15, was selected as a \\u201cbuy\\u201d due to its undemanding valuations and high growth potential, said the research house. \\u201cWe expect its vehicle sales to jump 17%/37% to 9.5 thousand/13 thousand units in FY14/15 driven by the 5 new SkyActiv launches planned over the next 3 years,\\u201d said Ivan Yap, analyst at Maybank IB. Cahya Mata Sarawak Bhd (CMSB), with TP of RM10.50, is seen as the primary beneficiary of the buoyant construction sector. Analyst Chai Li Shin of Maybank IB said CMSB\\u2019s investment in ferrorsilicon smelter and integrated phosphate plant will continue to drive construction activities in Sarawak Corridor of Renewal Energy. Oldtown Bhd (TP: RM2.67 ) justified its position on the list with a dominant market share in the white coffee segment and its expansion into China. \\u201cOldtown still has the biggest market share in the white coffee segment in Hong Kong (50%) and Malaysia (35%) despite the influx of new labels in the fastest growing coffee segment\\u201d said analyst Kang Chun Ee of Maybank IB. Sime Darby (TP: RM10.20), held its own on the list with a diversified portfolio of businesses spanning across Asia. \\u201cThe potential spin-off of its property, motor, and Indonesia plantation divisions may re-rate the stock upwards in the medium term ... Sime is also on the lookout for more plantation land to sustain its earnings growth in the long run,\\u201d commented Ong Chee Ting of Maybank IB. Top Glove (TP: RM6.00 ), a rubber glove giant with global market share of 25%, is poised to improve its earnings this quarter on cost reduction drives and improving China operations, said analyst Lee Yen Ling at Maybank IB. Wesports (TP: RM2.70) is geographically well positioned to capture growth in the region and will ride on the growth of the intra-Asia trade, especially with ASEAN emerging as a key manufacturing hub, added Lee. FGV (TP: RM4.48) is maintained at a \\u201chold\\u201d rating with potential catalyst coming from M&As in the future, said the research house. Meanwhile, BIMB Holdings (hold, with TP: RM4.30\\u00a0 ) has maintained its edge by being the only listed financial institution that Shariah funds can invest in, the research house said. On Malayan Banking, the research house said this banking institution remains the largest financial group in Malaysia and the second largest in ASEAN by market capitalisation. No rating was given. The booklet giving recommendations to these nine companies was released in conjunction with the company\\u2019s Invest ASEAN 2014 Conference held in Singapore."}, "14": {"date_posted": "14/3/2014", "title": "Stocks To Watch: KLCI index stocks, aviation shares, Mah Sing, Karex, BHIC, Sime Darby, TAS", "article": " KUALA LUMPUR (March 14): KLCI index-linked stocks may continue to respond negatively to the tensed situation in Ukraine on Monday (March 17) if political developments there worsens on Sunday. Russia has made it clear it would veto a U.S.-drafted UN resolution to declare illegal Sunday's referendum in Crimea, and has launched new exercises near its Ukrainian border in the face of sterner-than-expected sanctions from the United States and the EU. Today, Russia shipped more troops and armour into Crimea and repeated its threat to invade other parts of Ukraine, showing no sign of listening to Western pleas to back off from the confrontation, reported Reuters. Russia's stock markets tumbled before pro-Moscow authorities in Crimea hold a vote to join Russia, a move all but certain to lead to U.S. and EU sanctions on Monday. The Russian Foreign Ministry repeated President Vladimir Putin's declaration of the right to invade to protect Russian citizens and \"compatriots\". Aviation-linked stocks such as AirAsia Bhd, Malaysia Airports Bhd and Malaysia Airlines System Bhd (MAS) may be affected if the current hot weather and haze continue to envelop the country unabated. AirAsia today announced flight cancellations to and from Pekanbaru, Indonesia, for today and tomorrow due to the low visibility caused by severe haze. \"The presence of thick haze reduces pilot visibility to below 1,000 meters, which is the minimum level of flight visibility required for safe operations,\" said the low-cost carrier in a statement. The cancellation of AirAsia flights from and to Pekanbaru involved six routes. AirAsia also said all affected flights are expected to resume on March 16, depending on visibility. Mah Sing Group Bhd aims to increase its sales by 20 per cent to RM3.6 billion this year from RM3 billion last year, managing director Tan Sri Leong Hoy Kum told the media today. He said projects, with a total gross development value (GDV) of RM4 billion to be launched this year, would help the company realise the target, reported Bernama. At the EGM today, Mah Sing's shareholders voted in support of the group\\u2019s land acquisition in Pasir Gudang. The 1,352 acres of freehold land is expected to have an estimated GDV of RM5 billion. The land was acquired for RM411.16 million. \\u201cWith the acquisition of a plot of land in Shah Alam yesterday, and today's endorsement to buy land in Bandar Meridin East, Mah Sing\\u2019s total land bank now is 2,818 acres, with a GDV of RM26.82 billion. \\u201cToday, Mah Sing has a total unbilled sales and remaining GDV worth RM31.26 billion, inclusive of RM4.44 billion unbilled sales or 2.6 times revenue from the property development in 2013,\\u201d said Leong. Karex Bhd is spending about RM80 million to build a new factory in Pontian as part of its expansion plan. The company now has factories in Port Klang and Hat Yai in Thailand. CEO Goh Miah Kiat said the new factory, to be built on a 7.28-hectare site, is slated for completion by year-end. He said rising awareness of the importance of condom use and growing global population were driving demand for condoms going forward. Last year, a total of 22.8 billion pieces of condoms were sold. The group has a combined production capacity of four billion condoms currently. \"We target to achieve a production capacity of six billion pieces by end-2015,\" Goh told Bernama after the company's extraordinary general meeting. He said Karex, which has a 10 per cent share in the global condom market, is expected to show good growth this year. For the six-month ended Dec 31, 2013, Karex posted a pre-tax profit of RM27.37 million from RM17.96 million in the same period last year, whilst revenue rose to RM147.58 million against RM118.69 million previously. Boustead Heavy Industries Corporation Bhd (BHIC)\\u2019s subsidiary Boustead Penang Shipyard Sdn Bhd has secured a RM108 million contract from Murphy Sarawak Oil Co Ltd for the fabrication of offshore Belum topsides. The BHIC unit announced that the project was for the provision of engineering, procurement, construction and commissioning of offshore topsides for Block SK309 Belum Satellite-A Platform, in phase two of the Sarawak Gas Development project. The contract is targeted for completion by June 2015. \\u00a0 The successful completion of the contract would further solidify BHIC's reputation in the area and enable it to tap more opportunities within the dynamic sector not only locally but abroad, said the company. Sime Darby Bhd has acquired a controlling 70% stake in Australia\\u2019s mining maintenance services firm TFP Engineering Pty Ltd for A$3.2 million (RM9.5 million). TFP's prized asset is its \\u201cPakka Jacks\\u201d jacking-lifting system, used for the maintenance of mining equipment. Sime Darby said its wholly-owned subsidiary Haynes Mechanical Pty Ltd purchased the stake from TFP's owners Gaylene Elaine Poke and Tony Francis Poke last month (February). \"The acquisition will enable Haynes to expand its labour hire opportunities from its existing geographical presence in Queensland and Western Australia to the New South Wales coal basin, Tasmania and South Australia,\" Sime Darby said. According to Sime Darby, the firm has the call option to buy the remaining 30% in TFP for A$1.8 million. TAS Offshore Berhad announced that its wholly-owned subsidiary has secured a contract for the sale of one unit of utility tug valued at RM13.2 million. \\u201cThe vessel was sold to one of our new foreign customers. The vessel is expected to be delivered in April 2015,\\u201d said TAS Offshore. The company said the revenue generated from the contract would contribute positively to the earnings and net assets of TAS Group for financial year ending 31 May 2014 and 2015."}, "15": {"date_posted": "6/3/2014", "title": "Mid-morning Market: KLCI wobbles on external jitters", "article": " KUALA LUMPUR (March 6): The FBM KLCI wobbled at mid-morning on Thursday as it eked out meagre gains against the backdrop of diplomatic efforts to moderate the crisis over Ukraine lifted sentiments at most markets. At 10am, the FBM KLCI gained 0.71 points to 1,829.82. Gainers led losers by 255 to 165, while 247 counters traded unchanged. Volume was 566.95 million shares valued at RM323.67 million. The gainers included Cahya Mata Sarawak, KLCC, Lafarge Malaysia, MISC, Hong Leong Capital, Golsta, Muhibbah and Integra. Ingenco was the most actively traded counter with 78.28 million shares done. The stock fell half a sen to 10 sen. The other actives included Astral Supreme, Scomi, Minetec, Hubline, Nexgram, MAS, Daya Materials and Wintoni. The losers included Bat, KESM, UMW, BHIC, Sime Darby, Aeon, Narra and Genting. M & A Securities research head Rosnani Rasul said Wall Street barely made a dent in trading on Wednesday as it ended flat as most eyes were still watching closely the development in Ukraine. She said the S&P 500 and DJIA shaved a paltry 0.10 and 35.70 points to end at 1,873.81 and 16,360.18 respectively. Rosnani said that although a full blown international crisis in Ukraine was very remote for now but then again equity market was all about sentiment. \\u201cHence, the situation there will be closely followed as a small eruption of war or military response could mean a huge dent in trading sentiment as the aftermath impact could be colossal including the pain it can inflict to the US and Japan\\u2019s economy given the likely pressure in crude oil price. \\u201cIn line with this, the sentiment could still be wobbly as depicted in the current investing mood in Wall Street,\\u201d she said. Rosnani said that as expected, the jubilant trading sentiment yesterday was short lived and this wobbliness could last in the immediate term. She added that given less-than-encouraging overnight close in Wall Street and added with lack of fresh catalyst to move the market, the market was predicted to trade in sideways today with downside risk. \\u201cThe fluid situation in Ukraine could push some investors to the sideline,\\u201d she said. Elsewhere, Asian shares could enjoy a reprieve on Thursday as diplomatic efforts moderate the crisis over Ukraine, while the euro comes under pressure as investors speculate whether the European Central Bank will ease policy later in the day, according to Reuters. Any steps the ECB takes to support the still-fragile euro zone economy could benefit some assets, though gains could be limited ahead of pivotal U.S. payrolls data on Friday, it said."}, "16": {"date_posted": "28/2/2014", "title": "Stocks To Watch: Sime Darby, PPB, MahSing, Oriental Holdings, KNM, Bintulu Port, Brahim\\u2019s, Muhibbah, MNRB, Kulim, KPJ", "article": " KUALA LUMPUR (Feb 28): Based on corporate results released today, some of the companies that may attract investor attention on Monday (March 3) include the following: Sime Darby Bhd said it posted a net profit of RM818.3 million for the second quarter ended 31 December 2013 (2QFY2014), up 15.5% compared to the previous year's corresponding quarter, due to reduced taxes. This quarterly profit was achieved on reduced turnover of RM10.88 billion, versus RM11.25 billion a year ago, according to its filing with Bursa Malaysia. For the half year ended December (1HFY2014), the group reported a net profit of RM1.3 billion, a decline of 23% year-on-year. Revenue totalled RM21.64 billion, compared with RM22.99 billion posted in the first half of the previous financial year. The group announced an interim dividend of 6 sen per share for the financial year ending 30 June 2014. Reviewing performance of various divisions in the second quarter, Sime Darby said its plantation, motors, industrial, energy and utilities divisions posted a lower profit before interest and tax (PBIT). But its property division posted higher PBIT. PPB Group Bhd\\u2019s net profit for the fourth quarter fell 8% year-on-year to RM280.7 million, from RM306.0 million previously. Revenue rose 15% to RM900.2 million in 4QFY13 from RM782.6 million in 4QFY12. The group declared a final single-tier dividend of 17 sen per share, payable on June 6, 2014. Net profit for the full year rose to RM994.2 million from RM842.2 million in the previous year, while revenue rose to RM3.31 billion from RM3.02 billion. The lower profit for the quarter was attributed to lesser contribution from its associate, Wilmar International Ltd and lower profits from its flour and feed milling, and grains trading segment. On the other hand, revenue was higher as most of the group\\u2019s segments had registered higher revenue, with the exception of its environmental engineering segment. Mah Sing Group Bhd reported a 28% growth in fourth quarter net profit from a year earlier as revenue rose. Mah Sing said net profit grew to RM70.7 million in the fourth quarter ended December 31, 2013. Revenue was higher at RM570.2 million compared with RM441.4 million. Full-year net profit rose to RM280.6 million from RM230.6 million a year earlier. Revenue climbed to RM2.01 billion from RM1.78 billion. Mah Sing has proposed a first and final single-tier dividend of eight sen a share. Mah Sing said the group had increased its unbilled sales to a record high of RM4.4 billion, after achieving its targeted RM3 billion sales during the year. RHB Research Institute said the earnings of Mah Sing Group Bhd were in line with expectations. The research house has upgraded the stock to \\u201cbuy\\u201d from \\u201cneutral\\u201d as it expects Mah Sing to post higher earnings this year. But it keeps the stock\\u2019s fair value at RM2.44. Oriental Holdings Bhd said its net profit for the fourth quarter to end-December 2013 rose to RM74.2 million, up from RM40.7 million in similar quarter a year ago. Revenue was at RM757.3 million versus RM743.9 million a year ago. But for the full year of 2013 to end-December, net profit fell to RM187.5 million from RM200.6 million in 2012 while revenue fell to RM2.76 billion from RM2.81 billion. Its directors recommended a dividend of 3.5 sen per share. KNM Group Bhd reported a net profit of RM3.1 million in the fourth quarter ended December 31, 2013, versus a net loss of RM40.7 million a year earlier. KNM said full-year net profit fell to RM23.8 million from RM72.3 million a year earlier. Revenue was lower at RM1.99 billion versus RM2.39 billion. Bintulu Port Holdings Bhd said its net profit for the fourth quarter to end-December 2013 rose to RM53.7 million, from RM32.3 million a year ago. But revenue was near flat at RM137.0 million. For the full year of 2013 to end-December, profit rose to RM157.9 million from RM146.4 million in 2012 while revenue rose to RM529.8 million from RM506.2 million. Its directors recommended a final single tier dividend of 7.50 sen per share. The company said the effective tax rate for the year was lower, primarily due to the recognition of deferred tax benefit of RM14.43 million relating to an unutilised investment tax allowance for a subsidiary. Brahim\\u2019s Holdings Bhd reported net profit of RM12.0 million for its fourth quarter ended Dec 31, 2013, up 150% year-on-year (y-o-y) from RM4.8 million. Revenue for the quarter had also rose multiple folds to RM109.0 million from RM2.4 million in the previous year\\u2019s same quarter. For the full year, net profit increased to RM22.2 million from RM8.7 million in the previous year, while revenue soared to RM394.7 million from RM9.8 million. The company declared a dividend of 0.25 sen per share. Muhibbah Engineering (M) Bhd jumped out of the red, reporting a net profit of RM24.6 million for its fourth quarter, from a net loss of RM145.9 million in the previous year\\u2019s same quarter. However, revenue for 4QFY13 fell by 37% to RM631.6 million from RM1.00 billion in 4QFY12. Cumulatively, the group made a net profit of RM85.2 million for the year ended Dec 31, 2013, from a net loss of RM93.2 million in 2012. Full year revenue was lower at RM1.90 billion, compared with RM2.63 billion in the previous year. A dividend of 4.5 sen was proposed by the group, subject to the approval of shareholders. MNRB Holdings Bhd saw a rise in its net profit by 20.6% for the nine-month period ended 31 December 2013, mainly due to the improved performance in its reinsurance subsidiary, the company said. The group\\u2019s reinsurance subsidiary reported RM1.08 billion in revenue, an increase of 2.9% from RM1.04 billion recorded in the corresponding period last year. Its takaful arm saw revenue increase by 4.8% from RM601.4 million to RM630.2 million during the first nine months of the year. But re-takaful business, however, recorded a net loss of RM28.1 million for the period. Kulim Bhd posted a net profit of RM 3.4 million for the fourth quarter ended Dec 31, 2013 versus a loss of RM39.4 million in similar quarter a year ago. Revenue for the quarter fell to RM661.7 million from RM714.0 million Net profit for the full year rose to RM431.0 million, from RM211.2 million the previous year. Revenue for the full year fell to RM2.85 billion, from RM3.03 billion last year. KPJ Healthcare Bhd's net profit fell 2% to RM32.7 million in the fourth quarter ended December 31, 2013 from RM33.4 million a year earlier. Revenue, however, rose to RM634.5 million from RM510.6 million. The company said higher finance cost had curbed profit growth. Full-year net profit fell to RM102.5 million from RM140 million a year earlier. Revenue was higher at RM2.33 billion versus RM2.1 billion. The firm plans to pay a dividend of two sen a share."}, "17": {"date_posted": "25/2/2014", "title": "Market Close: KLCI pushed up 0.28% to 1833.75 by late trades", "article": " KUALA LUMPUR (Feb 25): The FBM KLCI rose 5.07 points or 0.28% to close at 1833.75 after last-minute push-up of some key blue chips. Choo Swee Kee, chief investment officer of TA Enterprise, told theedgemalaysia.com that the market was holding up quite well today as investors opted for small-cap and mid-cap stocks. But blue chips such as Petronas Gas, Sime Darby, RHB Capital, IOI Corporation, CIMB, Maxis, Telekom were instrumental in supporting the index near market close. Still, it was the small and mid-cap stocks which made up the bulk of trades today. Choo said that this pattern has been prevalent since after Chinese New Year and might go on for a few more weeks. Across the exchange, a total of 2.14 billion shares worth RM1.33 billion were traded, with losers leading gainers by 547 to 294. A total of 306 counters were traded unchanged. Fima Corporation Bhd was the top gainer on the bourse, while Iris Corporation Bhd was the most active stock. The top loser was Kuala Lumpur Kepong. Across the region, Japan\\u2019s Nikkei was up 1.2% while South Korea\\u2019s KOSPI rose 0.8%. However, China\\u2019s CSI300 index fell 2.6%, while the Shanghai Composite Index closed 2.0% lower. Nearer home, Singapore\\u2019s Straits Time Index lost 0.07% to 3103.62."}, "18": {"date_posted": "15/1/2014", "title": "Market Close: KLCI falls 0.6% on CIMB, weaker ringgit amid political rumblings", "article": " KUALA LUMPUR (Jan 15): The stock market, already clouded by expensive valuation, was weighed down by the fall in CIMB Group Holdings Bhd and other big cap stocks amid political squabbles in the country. The fall of the ringgit today also prompted the market to react negatively. Bloomberg reported that during mid-afternoon trades, the ringgit weakened 0.8%, the most among Asian currencies, as U.S. retail sales figures bolstered the case for the Fed\\u2019s stimulus cuts. At 5.00 pm market close, the key FBM KLCI index lost 10.94 points or 0.6% to end at 1824.03 points. It had hit a low of 1818.99 earlier. Trades done were high at 2.36 billion shares valued at RM2.70 billion. But elsewhere in the Asian region (apart from Thailand), stock markets rose after overnight gains in US stock markets on stronger consumer spending data there. The World Bank's upgrade on the world economy had also supported Asian equities. \\u201cThe local market was dragged down by CIMB and other heavyweights. I believe foreign selling has continued today as local valuation is high,\\u201d said Lee Cherng Wee, senior analyst at JF Apex Securities Bhd. CIMB shares closed down 20 sen or 2.7% at RM7.10 after the banking group said it is raising RM3.55 billion via sale of new shares. Analysts said there will be earnings dilution in the group. The other heavyweights that had dragged the KLCI down included index-linked Tenaga Nasional, UMW, Petronas Gas, Maybank, Sime Darby, Genting, KLK, KLCC and Petrochem. Societe Generale, while making a \\u201cneutral\\u201d call on Malaysia today, said the local market\\u2019s valuation is high and is trading at a 12-month P/E of 15.3x. \\u201cMore important, relative to the rest of the region, it is trading at a 34% premium which is high compared to history,\\u201d it said in its research note. An investment banker told theedgemalaysia.com: \\u201cThe expected weakening ringgit vis-a-vis US dollar over the medium term has also caused the market fall. Political rumblings is another reason.\\u201d Of late, the country has been embroiled in high-tension religious and political debates. Today, the opposition party DAP said it will be sueing the Registrar of Society for not granting legal recognition of its party leadership. \\u00a0 At Bursa Malaysia, top gainers included IOI Properties Group Bhd, which made its debut trading today, and financial outfits of Hong Leong group. Bloomberg reported that emerging-market stocks rose, led by exporters, on speculation the global economy is strengthening but the Malaysian ringgit paced a drop by developing-nation currencies. The MSCI Emerging Markets Index rose 0.2 percent to 977.26 as of 4:20 p.m. in Hong Kong. The World Bank raised its global growth forecasts, boosting prospects for developing markets\\u2019 exports. Federal Reserve officials Charles Evans and Dennis Lockhart will speak today in the U.S, where the central bank\\u2019s Beige Book business survey is due after yesterday\\u2019s retail-sales report topped estimates."}, "19": {"date_posted": "13/1/2014", "title": "Stocks To Watch: CIMB, Sime, Puncak Niaga, KDEB, Naim Hldgs, CYL, Scomi Energy, Minetech, INS BioScience", "article": " KUALA LUMPUR (Jan 13): Based on news flow and announcements today, the following companies may lure some interest on Wednesday (Jan 15). The stock market will be closed tomorrow (Jan 14) in conjunction with the birthday of Prophet Mohammad. CIMB Group Holdings Bhd, which suspended trading of its securities today pending a \\u201cmaterial announcement\\u201d, is raising as much as $1.1 billion through new shares to boost its core capital as Southeast Asia's fifth largest lender takes on its rivals in credit and equity markets at home and abroad, Reuters reported. At press time (7.00 pm), CIMB still has not come out with any official statement yet. Reuters added CIMB is bracing for more credit demand on the back of rapid economic growth in Malaysia and a pipeline of large initial public offerings this year. Its consumer and corporate loan businesses have also been growing at double-digit rates, fuelled by strong economic growth in Southeast Asia. CIMB's core capital has lagged larger regional peers. Its common equity tier 1 ratio was 8.2 percent at the end of September, below local rival Maybank's 10.79 percent. DBS Group Holdings', Southeast Asia's biggest lender, had a common equity tier 1 ratio of 13.3 percent at the end of September. The CIMB share sale is the biggest in Malaysia since Malayan Banking Bhd, or Maybank, tapped equity markets with a $1.2 billion offering in October 2012, Thomson Reuters data showed. CIMB is selling 400 million new shares for 7.10 ringgit to 7.25 ringgit each, representing a discount of 2.7 percent to CIMB's Friday closing price, according to a term sheet of the deal seen by Reuters on Monday. Underwriters of the offering have the option to increase the deal by up to $222 million to meet additional demand, taking the total deal size to $1.1 billion. \"The base deal size shares is covered at the wide end of the range. Large orders from existing shareholders, key local institutions and international investors,\" said a person with direct knowledge of the matter who declined to be named. The bank will use the proceeds to fund growth in subsidiaries, reduce debt and for working capital needs, the term sheet said. Sime Darby Bhd\\u2019s rating stays. Fitch Ratings has affirmed Sime Darby Long-Term Foreign and Local Currency Issuer Default Ratings (IDR), and senior unsecured rating at 'A'. The outlook is stable. Fitch has also affirmed the rating on SIME's US$1.50 billion sukuk issue at 'A'. \\u201cThe ratings reflect Sime Darby's scale and business diversity, its strong market position in the crude palm oil (CPO) business, consistent generation of positive fund flows from operations and moderate financial leverage,\\u201d said the international rating agency. \\u201cAlthough Sime Darby's financial performance was weaker in its fiscal 1Q ended 30 September 2013, Fitch expects it to maintain its performance at FY13 levels because of stronger CPO prices,\\u201d it added. Puncak Niaga Holdings Bhd\\u2019s Selangor raw water license was terminated today in favour of Kumpulan Darul Ehsan Berhad (KDEB), said Selangor Mentri Besar Tan Sri Abdul Khalid Ibrahim. He said in a statement: \\u201cWe have instructed the Selangor Water Management Authority to coordinate the issuance of raw water to be given to state-owned company, Kumpulan Darul Ehsan Berhad (KDEB), in line with the restructuring plans of Selangor's water industry. \\u201cAccordingly, the raw water license which has been granted to concessionaires including Puncak Niaga will be terminated.\\u201d Khalid said the state government will start the project Horas (Hybrid Off River Augmentation System) in Sungai Selangor, which he said is able to supply 600-700 million litres of clean water per day. \\u201cWith Horas, Selangor people will not be too dependent on the Langat 2 plant project and that the water consumers in Selangor, Kuala Lumpur and Putrajaya will get continuous water supply.\\u201d Companies expected to be involved in the 4.14-billion ringgit Langat 2 project include Puncak Niaga-linked companies and Gamuda Bhd. Naim Holdings Bhd announced that it had on Jan 9 and Jan 10 disposed 15 million shares or 2.7% stake in Dayang Enterprise Holdings Bhd on the open market for RM84,008,025. \\u201cThe proceeds represent a premium of RM4.43 per share or 378.6% above the unaudited net asset per share of Dayang of RM1.17 as at 30 September 2013,\\u201d said Naim in a filing with Bursa Malaysia. Naim said the proceeds from the disposal would be utilised for working capital of the company. It said the company held 33.63% equity interest in Dayang prior to the disposal. The Sarawak company said based on the unaudited consolidated quarter report of Naim as at Sept 30, 2013, the proforma effects of the disposal on the net asset per share and gearing of Naim are expected to improve to RM3.77 and 0.38 times, from RM3.52 and 0.40 times, respectively. \\u201cNaim expects to record a proforma gain of about RM62 million from the disposal in the current year.\\u201d CYL Corporation Bhd announced that the company has declared an interim tax exempt dividend of 4% amounting to RM2 million in respect of the financial year ending 31 January 2014. The interim tax exempt dividend will be paid on Feb 12 to the shareholders, whose names appear in the Record of Depositors on Jan 29, 2014, said the company. Scomi Energy Services Bhd (SESB) has secured a RM75 million contract from Virginia Indonesia Co. SESB chief executive officer Shah Hakim Zain said today the contract entails the provision of solids-control equipment and environmental-handling services for a period of 36 months. With the new contract, SESB\\u2019s order book now stands at over RM5.2 billion. Minetech Resources Bhd clarified it is in the exploratory stage of discussions with a party, on a casino and hotel project in Cambodia, but there is no firm commitment yet. The discussion revolves around undertaking construction and raw material supply in relation to the project, said the mining firm in reference to a local daily reporting of its possible casino venture in Cambodia.  \\u201cMatters are still at a very preliminary stage and nothing is confirmed yet,\\u201d said the firm. \\u201cMinetech has yet to be awarded any job in relation thereto.\\u201d INS BioScience Bhd\\u2019s further appeal for an extension of time up to Jan 31, 2014, to submit the company\\u2019s regularisation plan has been rejected by Bursa Malaysia. Due to this latest development, the securities of the company will be removed from the official list of Bursa Securities on Monday, 20 January 2014, said Bursa Malaysia. Upon de-listing of the company, the ACE-Market company will continue to exist but as an unlisted entity."}, "20": {"date_posted": "13/1/2014", "title": "Stocks to watch: WZ Satu, Bursa among firms in focus", "article": " KUALA LUMPUR: Based on official and corporate announcements last Friday, the companies and stocks that may spark some interest today include the following: WZ Satu Bhd announced three proposals that will see the company undertake a renounceable rights issue, purchase a construction and engineering company and go into bauxite mining. The first proposal entails a renounceable rights issue of up to 55 million new ordinary shares of RM0.50 each in WZ Satu at an issue price of RM0.60 per rights share, on the basis of one rights share for every two existing WZ Satu shares held. The second proposal involves the acquisition of KenKeong Sdn Bhd for RM27.5 million,\\u00a0which would result in a diversification in the operations of WZ Satu into civil engineering and construction. The third proposal is the entering into a bauxite mining works agreement by SE Satu Sdn Bhd, a 49%-owned company of WZ Satu, with Kreatif Selaras Mining Sdn Bhd for SE Satu to be engaged as a contractor to mine, extract and produce bauxite ore. Fitters Diversified Bhd plans to list its wholly-owned renewable energy unit Future NRG Sdn Bhd (FNRG) on Singapore Exchange\\u2019s\\u00a0Catalist, the sponsor-supervised board of the bourse. Fitters said FNRG has appointed Singapore-based PrimePartners Corporate Finance Pte Ltd as full sponsor for the proposed listing of FNRG. PrimePartners will remain as the continuing sponsor for FNRG upon completion of the exercise. But the company said: \\u201cThere is no assurance that official approvals or clearance would be obtained or that the proposed listing may occur. Therefore, investors should note that the listing of FNRG shares on Catalist may or may not occur.\\u201d Sime Darby Bhd said its plantation arm Sime Darby Plantation Sdn Bhd has achieved its first RSPO certification for smallholders under Indonesian subsidiary, PT Minamas Gemilang. The achievement was one year ahead of the mid-2014 target set for PT Minamas smallholders to be RSPO (Roundtable of Sustainable Palm Oil) certified. As a result of the RSPO certification, PT Minamas\\u2019s three mills have now achieved segregated status under the RSPO Supply Chain Certification System (SCCS). This has raised the number of PT Minamas\\u2019 segregated status mills to 17 out of a total 21 RSPO certified mills. The certification will give Sime Darby the advantage of gaining further access to the international sustainable palm oil market, the diversified conglomerate said. Jobstreet Corp Bhd (JCB), a leading online recruitment services provider, announced its acquisition of the remaining 19% interest in JS Vietnam Holdings Pte Ltd (JSV). \\u00a0 JCB said it has acquired the 19% stake with a cash consideration of RM1,195,838, to be satisfied via the issuance of 522,000 ordinary shares in JCB. The rationale for the proposed acquisition is \\u201cto strengthen JCB\\u2019s presence in Vietnam\\u2019s online recruitment market\\u201d. The proposed acquisition is expected to be completed in the first quarter of 2014. Berjaya Assets Bhd and its unit Berjaya Times Square\\u00a0clarified that \\u201cthere is no truth to the speculation regarding the possibility of the company being given the right to operate a gaming establishment akin to a casino in the State of Johor\\u201d. This statement came after the Menteri Besar of Johor said casino operations similar to Singapore will not be allowed in the State of Johor. Bursa Malaysia Bhd may come under investors\\u2019 radar after Insider Asia\\u2019s upbeat report on the stock exchange this week and its earnings. Bursa is set to announce its earnings results for the last quarter of the financial year ended Dec 31, 2013 on Jan 29. \\u201cWe expect earnings in 4Q13 to be slightly better than that in 3Q13. Average daily value traded improved to RM2.3 billion during the quarter, up from RM2.08 billion in 3Q13. The number of derivatives contracts traded in 4Q13 is also likely to have grown further,\\u201d commented Insider Asia. \\u201cWe forecast net profit for 2013 at roughly RM189.6 million, up some 25% from the previous year.\\u201d Bursa\\u2019s turnover in the first nine months of 2013 grew 12% y-y to RM361 million, while net profit expanded by 20% to RM139 million over the same period, driven by securities and derivatives trading activities. Sime Darby Plantation Sdn Bhd has achieved its first RSPO certification for smallholders. Seacera Group Bhd is buying a 60% stake in a privately-owned builder with some RM168 million worth of local projects in hand. The planned acquisition marks Seacera\\u2019s foray into the construction sector. Seacera, which manufactures tiles and developes properties, said it is subscribing to shares in SPAZ Sdn Bhd\\u2019s expanded issued base for RM3 million. Seacera said the move offers the \\u201copportunity for the company to diversify and leverage on its expertise in trading of tiles and general construction building materials\\u201d. SPAZ has been in the construction industry for more than 10 years. Plantation stocks may come under focus after investors digest and analyse the latest official data of palm oil over the weekend. The crude palm oil futures market fell across the board last Friday after the figures were released in the afternoon. The benchmark March futures fell RM20 to close at RM2,519 per tonne. \\u00a0 Malaysian palm oil inventory rose 0.33% to 1.99 million tonnes in December 2013 from 1.98 million tonnes in November, said the Malaysian Palm Oil Board (MPOB). MPOB said CPO output fell 10.43% to 1.67 million tonnes from 1.86 million tonnes, while\\u00a0 palm oil exports declined 1.36% to 1.51 million tonnes from 1.53 million tonnes. This article first appeared in The Edge Financial Daily, on January 13, 2014."}, "21": {"date_posted": "3/1/2014", "title": "Stocks To Watch: Index stocks, blue chips, Benalec, CBIP, Perak Corporation and Yinson", "article": " KUALA LUMPUR (Jan 3): Index-linked stocks and blue chips may continue to rule the market on Monday (Jan 6) if they are still considered as overbought due to their rise over the past month on window-dressing activities. Many fell today.\nAt market close today, the FBM KLCI fell 18.21 points or 1% to end at 1,834.74 on institutional selling of major blue chips such as Petronas Dagangan and PetGas, Tenaga Nasional, SapuraKencana Petroleum, Genting, plantation stocks (KLK, PPB and Sime Darby), Public Bank and CIMB, Aeon Credit.\nThe fall of the local market was in line with most regional markets today, which were consolidating after rising to their highs in recent weeks on more positive global economic data.\nBut in addition to these two factors, the local market sentiment may be hit if senior government politicians and their followers heed UMNO Selangor\\u2019s proposal to demonstrate outside Catholic churches during their prayers on Sunday, as this may stir up unwarranted religious tension in this multi-racial country.\nBenalec Holdings Bhd informed Bursa Malaysia that Datuk Leaw Tua Choon, a substantial shareholder of Benalec, has sold 482 shares in Oceancove Sdn Bhd to Datuk Leaw Seng Hai and 1,218 Oceancove Shares to Datuk Leaw Ah Chye.\nOceancove is a major shareholder of the company holding 52.90% of the shares in Benalec.\nTua Choon has also sold his entire shareholding in Oceanview Cove Sdn. Bhd. to Seng Hai. Oceanview is the ultimate holding company of Benalec and the holding company of Oceancove.\n\\u201cThe disposals are made in accordance with terms and conditions agreed by the three Leaw brothers under a private Heads of Agreement (HoA) signed by all three of them on 4 December, 2013.\n\\u201cIn consequence of Datuk Leaw Tua Choon\\u2019s disposal of all his shares in Oceancove and Oceanview, he has thereby ceased to be a substantial shareholder of Benalec,\\u201d said a statement from Benalec.\nAs a result, Leaw Seng Hai has raised his indirect interest in Benalec shares from 15.34% or 123,760,341 shares to 23.71% or 191,261,841 shares, while Leaw Ah Chye has increased his indirect interest in Benalec shares from 14.82% or 119,501,499 shares to 21.26% or 171,501,499 shares.\nPursuant to the said private Heads of Agreement, Leaw Ah Chye has granted an option, exercisable within a 2-year period, to Leaw Seng Hai to purchase at least 30% of the indirect interest in Benalec shares currently held by Leaw Ah Chye through his shareholding in Oceanview Cove Sdn. Bhd.\nThis announcement may signal an amicable end to the sibblings\\u2019 rivalry in Benalec. It could also mean that Seng Chai, the managing director of the company, is now in solid control of the management.\nTo recap, Benalec had on Oct 7, 2013, terminated the services of directors Tua Choon and Ah Chye.\nBoth Tua Choon and Ah Chye, who are the elder brothers of Seng Hai, were allegedly found guilty of misconduct on land sale deals.\nOn Nov 6, the Audit Committee called for an EGM to remove Tua Choon and Ah Chye as directors. However, the EGM was called off on Dec 4, after Tua Choon and Ah Chye had resigned.\nAccordingly, Benalec withdrew legal actions against Tua Choon and Ah Chye in favour of a HoA to set out the framework to settle all legal suits and claims.\nCB Industrial Product Holding Bhd (CBIP) has acquired a 100% stake in a\\u00a0firm which intends to undertake oil and gas (O&G) operations. The acquisition indicates CBIP's foray into the O&G sector.\nIn a statement to the exchange today, CBIP which builds palm oil mills, said\\u00a0its subsidiary AVP Engineering (M) Sdn Bhd yesterday bought TPG Oil & Gas Sdn Bhd from Tengku Ardy Esfandiari Tengku A. Hamid Shah and Ku Azhar Ku Ahmad for RM2. \"Currently, the intended business activity of TPG-OG is to engage in oil and gas businesses.\\u201d Perak Corporation Bhd said trading in its shares will be suspended with effect from 9.00 a.m. of Monday, January 6, pending an announcement.\nIf the announcement is major and market-moving, the share price of Perak Corporation is likely to react and move accordingly.\nBut by market close today, the stock had already risen 43 sen or 14% to RM3.49 per share on trades of some 3.7 million shares. The net asset per share of the company was RM5.03 as at end-September.\nYinson Holdings Bhd announced today various new appointments of Yinson Group\\u2019s executive positions and principal officers.\nLim Han Weng, group chairman and managing director has been re-designated as the group\\u2019s executive chairman and executive director, and Lim Chern Yuan, executive director of the group, has also been appointed as the group\\u2019s chief executive officer.\nAs Yinson group CEO, Lim Chern Yuan will oversee the overall performance of the group together with the Lim Han Weng, and holds key strategic role in formulating the strategic planning of the group.\n\\u201cWe believe that the new appointments will further enhance and ensure a proper and well-structured management hierarchy, supported by good corporate governance,\\u201d said Lim Han Weng, who will continue to oversee business formulation, implementation of corporate strategy and future growth of the group."}}